[{"id":"4214154893512787443","title":"What can WI players learn from India?","url":"http://trinidadexpress.com/sports/local/what-can-wi-players-learn-from-india/article_c305b99e-5dd5-11eb-82a8-a327849cdf8a.html","description":"A few hours after Indias exciting and historic win against Australia in Brisbane, a close friend sent me the following comments: FANTASTIC! They beat Australia with a novice bowling attack.","body":"Save\nA few hours after Indias exciting and historic win against Australia in Brisbane, a close friend sent me the following comments: FANTASTIC! They beat Australia with a novice bowling attack. They chased 320 odd in the fourth innings. That should inspire our players (in Bangladesh).\nA few days before the Brisbane Test, an editor of one of Indias largest newspapers contacted me and asked: What advice would you give to Team India? They are depleted for the Brisbane Test due to injuries. I am writing a piece on the Brisbane Test. The editor was concerned that Team India would play below their normal standard and would lose the Test match and the Test series.\nI understood his concerns, but I perceived the situation differently. I saw it as an opportunity for Team India to surprise the Australians; to put them under a level of pressure for which they were mentally unprepared. When you are not prepared for certain types of pressure, they hit you twice as hard and sabotage your thinking, game plan and performance. I knew that the omission of key players from Team India might encourage the Australians to underestimate Indias chances of winning, while overestimating their own. That expectation could then lead to overconfidence. Sir Garfield Sobers used to say: Overconfidence is a very dangerous thing. It is false confidence and is a prescription for failure.\nI also knew that factors other than physical skill would determine the outcome of the game. Skill and motivation are both necessary for good performance, but in too many cases motivation is a forgotten factor. I was confident that captaincy and motivation would play decisive roles in the outcome of the game.\nI told the editor: Rahane is motivating the team well and seems to be getting the best out of his players. If he continues in that fashion, the replacements in the team wi","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-23T23:50:00","provider":{"name":"trinidadexpress","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://bloximages.newyork1.vip.townnews.com/trinidadexpress.com/content/tncms/assets/v3/editorial/c/5c/c5cd4548-5dd5-11eb-a39e-5b81fc532788/600cb6640d693.image.jpg?resize=829%2C512","height":512,"width":829,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=1413324386770806633","thumbnailHeight":143,"thumbnailWidth":232,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"trinidadexpress","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"http://trinidadexpress.com/sports/local/what-can-wi-players-learn-from-india/article_c305b99e-5dd5-11eb-82a8-a327849cdf8a.html"}},{"id":"4531686909297093058","title":"Professor Arpit Shukla awarded PhD from Modi University, Rajasthan","url":"https://www.thehitavada.com/Encyc/2021/1/24/Professor-Arpit-Shukla-awarded-PhD-from-Modi-University-Rajasthan.html","description":"In India sugar industry is the second-largest agro-based industry is a segment of huge prominence to the Indian economy. Thus optimisation of sugar production process for the sake of economic, environmental and energy efficiency should be the prime concern. Based on all these facts, Professor Arpit Shukla has conducted a doctoral research work, for which he has been awarded PhD from Modi University, Rajasthan. Professor Shukla, son of Akhilesh Shukla and Saroj Shukla, has 16 years of vast experience in teac","body":"\n\nIn India sugar industry is the second-largest agro-based industry is a segment of huge prominence to the Indian economy. Thus optimisation of sugar production process for the sake of economic, environmental and energy efficiency should be the prime concern. Based on all these facts, Professor Arpit Shukla has conducted a doctoral research work, for which he has been awarded PhD from Modi University, Rajasthan. Professor Shukla, son of Akhilesh Shukla and Saroj Shukla, has 16 years of vast experience in teaching and research field in reputed Engineering institution of town.\n\nHis research work is to optimise the sugar production process in the existing sugar plant by utilising the sugar production by products i.e. Bagasses, Molasses and Press mud. Today when crisis of energy resources is a national problem and research on renewable energy sources is going on, research work accomplished by Shukla can be useful to solve national problem of energy crisis in a great extent. According to Professor Shukla, the industry is facing several problems including low yielding of sugarcane, fluctuating production trends, uneconomical size of mills, inefficient technology, old and obsolete machinery, etc, hence there is need to research in this field for reducing production cost and increasing efficiency of the plant production.","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-23T23:36:29","provider":{"name":"thehitavada","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://www.thehitavada.com/Encyc/2021/1/24/2_04_59_04_Professor-_1_H@@IGHT_455_W@@IDTH_334.jpg","height":455,"width":334,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=6073445073289724533","thumbnailHeight":113,"thumbnailWidth":82,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"thehitavada","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://www.thehitavada.com/Encyc/2021/1/24/Professor-Arpit-Shukla-awarded-PhD-from-Modi-University-Rajasthan.html"}},{"id":"4307538788009203440","title":"Indias farmers bust shootout plot to disrupt tractor parade on Republic Day","url":"https://pakobserver.net/indias-farmers-bust-shootout-plot-to-disrupt-tractor-parade-on-republic-day/","description":"New Delhi Indian farmers have broken a conspiracy to disrupt their announced tractor parade on the upcoming Republic Day, after they nabbed a masked man tasked to assassinate their four farmer leaders. The farmers at the Singhu border protest site presented a person at a press conference late Friday, who claims to be a part []","body":"127\nNew Delhi\nIndian farmers have broken a conspiracy to disrupt their announced tractor parade on the upcoming Republic Day, after they nabbed a masked man tasked to assassinate their four farmer leaders.\nThe farmers at the Singhu border protest site presented a person at a press conference late Friday, who claims to be a part of two teams assigned to shoot four farmer leaders and cause disruption in the protest on January 26.\nThe masked man admitted that his team members were asked to pose as policemen and baton-charge on the crowd if things go out of control during the January 26 tractor parade. He also named police officials involved in the plan.\nThe man, who was asked to speak at the press conference said that his team was to be at the farmers gathering in police uniforms and disrupt the rally. The media were also shown a photograph of four people, who were to be shot. He also mentioned the person who gave the directions to carry out the plan was a cop.\nThe person claimed to have been there at the protest site since January 19. He also said they were tasked to find out whether protesters were carrying arms.\nFor January 26, the plan was that our other team members would mingle with the protesters. And if the protesters approach with their parade, then we were asked to fire shots at them, the man said. He said, During the protests on January 26, the farmers will first be given a warning by the police and if they do not stop, then the plan is to shoot them in their knee first. Then our team of 10 will shoot from behind to make it look like the farmers have resorted to using firearms in Delhi, he said.\nThe man has been handed over to the Haryana Police and has been taken to Kundli Police","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-23T22:01:38","provider":{"name":"pakobserver","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://pakobserver.net/wp-content/uploads/2021/01/1-288.jpg","height":300,"width":500,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=8463660963938089382","thumbnailHeight":112,"thumbnailWidth":186,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"pakobserver","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://pakobserver.net/indias-farmers-bust-shootout-plot-to-disrupt-tractor-parade-on-republic-day/"}}]
