[{"id":"4214154893512787443","title":"What can WI players learn from India?","url":"http://trinidadexpress.com/sports/local/what-can-wi-players-learn-from-india/article_c305b99e-5dd5-11eb-82a8-a327849cdf8a.html","description":"A few hours after Indias exciting and historic win against Australia in Brisbane, a close friend sent me the following comments: FANTASTIC! They beat Australia with a novice bowling attack.","body":"Save\nA few hours after Indias exciting and historic win against Australia in Brisbane, a close friend sent me the following comments: FANTASTIC! They beat Australia with a novice bowling attack. They chased 320 odd in the fourth innings. That should inspire our players (in Bangladesh).\nA few days before the Brisbane Test, an editor of one of Indias largest newspapers contacted me and asked: What advice would you give to Team India? They are depleted for the Brisbane Test due to injuries. I am writing a piece on the Brisbane Test. The editor was concerned that Team India would play below their normal standard and would lose the Test match and the Test series.\nI understood his concerns, but I perceived the situation differently. I saw it as an opportunity for Team India to surprise the Australians; to put them under a level of pressure for which they were mentally unprepared. When you are not prepared for certain types of pressure, they hit you twice as hard and sabotage your thinking, game plan and performance. I knew that the omission of key players from Team India might encourage the Australians to underestimate Indias chances of winning, while overestimating their own. That expectation could then lead to overconfidence. Sir Garfield Sobers used to say: Overconfidence is a very dangerous thing. It is false confidence and is a prescription for failure.\nI also knew that factors other than physical skill would determine the outcome of the game. Skill and motivation are both necessary for good performance, but in too many cases motivation is a forgotten factor. I was confident that captaincy and motivation would play decisive roles in the outcome of the game.\nI told the editor: Rahane is motivating the team well and seems to be getting the best out of his players. If he continues in that fashion, the replacements in the team wi","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-23T23:50:00","provider":{"name":"trinidadexpress","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://bloximages.newyork1.vip.townnews.com/trinidadexpress.com/content/tncms/assets/v3/editorial/c/5c/c5cd4548-5dd5-11eb-a39e-5b81fc532788/600cb6640d693.image.jpg?resize=829%2C512","height":512,"width":829,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=1413324386770806633","thumbnailHeight":143,"thumbnailWidth":232,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"trinidadexpress","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"http://trinidadexpress.com/sports/local/what-can-wi-players-learn-from-india/article_c305b99e-5dd5-11eb-82a8-a327849cdf8a.html"}},{"id":"4531686909297093058","title":"Professor Arpit Shukla awarded PhD from Modi University, Rajasthan","url":"https://www.thehitavada.com/Encyc/2021/1/24/Professor-Arpit-Shukla-awarded-PhD-from-Modi-University-Rajasthan.html","description":"In India sugar industry is the second-largest agro-based industry is a segment of huge prominence to the Indian economy. Thus optimisation of sugar production process for the sake of economic, environmental and energy efficiency should be the prime concern. Based on all these facts, Professor Arpit Shukla has conducted a doctoral research work, for which he has been awarded PhD from Modi University, Rajasthan. Professor Shukla, son of Akhilesh Shukla and Saroj Shukla, has 16 years of vast experience in teac","body":"\n\nIn India sugar industry is the second-largest agro-based industry is a segment of huge prominence to the Indian economy. Thus optimisation of sugar production process for the sake of economic, environmental and energy efficiency should be the prime concern. Based on all these facts, Professor Arpit Shukla has conducted a doctoral research work, for which he has been awarded PhD from Modi University, Rajasthan. Professor Shukla, son of Akhilesh Shukla and Saroj Shukla, has 16 years of vast experience in teaching and research field in reputed Engineering institution of town.\n\nHis research work is to optimise the sugar production process in the existing sugar plant by utilising the sugar production by products i.e. Bagasses, Molasses and Press mud. Today when crisis of energy resources is a national problem and research on renewable energy sources is going on, research work accomplished by Shukla can be useful to solve national problem of energy crisis in a great extent. According to Professor Shukla, the industry is facing several problems including low yielding of sugarcane, fluctuating production trends, uneconomical size of mills, inefficient technology, old and obsolete machinery, etc, hence there is need to research in this field for reducing production cost and increasing efficiency of the plant production.","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-23T23:36:29","provider":{"name":"thehitavada","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://www.thehitavada.com/Encyc/2021/1/24/2_04_59_04_Professor-_1_H@@IGHT_455_W@@IDTH_334.jpg","height":455,"width":334,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=6073445073289724533","thumbnailHeight":113,"thumbnailWidth":82,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"thehitavada","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://www.thehitavada.com/Encyc/2021/1/24/Professor-Arpit-Shukla-awarded-PhD-from-Modi-University-Rajasthan.html"}},{"id":"4307538788009203440","title":"Indias farmers bust shootout plot to disrupt tractor parade on Republic Day","url":"https://pakobserver.net/indias-farmers-bust-shootout-plot-to-disrupt-tractor-parade-on-republic-day/","description":"New Delhi Indian farmers have broken a conspiracy to disrupt their announced tractor parade on the upcoming Republic Day, after they nabbed a masked man tasked to assassinate their four farmer leaders. The farmers at the Singhu border protest site presented a person at a press conference late Friday, who claims to be a part []","body":"127\nNew Delhi\nIndian farmers have broken a conspiracy to disrupt their announced tractor parade on the upcoming Republic Day, after they nabbed a masked man tasked to assassinate their four farmer leaders.\nThe farmers at the Singhu border protest site presented a person at a press conference late Friday, who claims to be a part of two teams assigned to shoot four farmer leaders and cause disruption in the protest on January 26.\nThe masked man admitted that his team members were asked to pose as policemen and baton-charge on the crowd if things go out of control during the January 26 tractor parade. He also named police officials involved in the plan.\nThe man, who was asked to speak at the press conference said that his team was to be at the farmers gathering in police uniforms and disrupt the rally. The media were also shown a photograph of four people, who were to be shot. He also mentioned the person who gave the directions to carry out the plan was a cop.\nThe person claimed to have been there at the protest site since January 19. He also said they were tasked to find out whether protesters were carrying arms.\nFor January 26, the plan was that our other team members would mingle with the protesters. And if the protesters approach with their parade, then we were asked to fire shots at them, the man said. He said, During the protests on January 26, the farmers will first be given a warning by the police and if they do not stop, then the plan is to shoot them in their knee first. Then our team of 10 will shoot from behind to make it look like the farmers have resorted to using firearms in Delhi, he said.\nThe man has been handed over to the Haryana Police and has been taken to Kundli Police","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-23T22:01:38","provider":{"name":"pakobserver","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://pakobserver.net/wp-content/uploads/2021/01/1-288.jpg","height":300,"width":500,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=8463660963938089382","thumbnailHeight":112,"thumbnailWidth":186,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"pakobserver","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://pakobserver.net/indias-farmers-bust-shootout-plot-to-disrupt-tractor-parade-on-republic-day/"}},{"id":"2209301537266963217","title":"Inside the worlds biggest vaccine factory: Indias Serum Institute","url":"http://gulf-times.com/story/683101/inside-the-world-s-biggest-vaccine-factory-india-s","description":"The tiny clinking vials supervised by silent PPE-wearing technicians belie the excitement inside the worlds largest vaccine manufacturer, the Serum Institute of India, a major player in the fight against coronavirus.","body":"A\nAFP/ Pune\nThe tiny clinking vials supervised by silent PPE-wearing technicians belie the excitement inside the worlds largest vaccine manufacturer, the Serum Institute of India, a major player in the fight against coronavirus.\nThe firm, founded in 1966 in the western city of Pune, is producing millions of doses of the Covishield vaccine, developed by AstraZeneca and Oxford University, for India and much of the developing world.\nUnlike the rival Pfizer-BioNTech vaccine, Covishield can be stored and transported using standard refrigeration.\nIt is also significantly cheaper than the vaccines developed by Pfizer or the US firm Moderna, making it better suited for countries with poorer populations and rusty infrastructure.\nEven before the pandemic, the Indian firm was a world leader in vaccines, producing 1.5bn doses a year and inoculating two out of three children in 170 countries against diseases such as polio, mumps, meningitis and measles.\nIts journey kicked off on a stud farm, where the firms owners, the Poonawalla family, began breeding horses in 1946, before a conversation with a vet sparked the realisation that anti-toxin serum extracted from the animals could be used to make vaccines.\nThe Serum Institute soon became a market leader thanks to its cheap and effective drugs, which were eagerly sought after by price-conscious governments and consumers, prompting the company to expand at a dizzying rate.\nAdar Poonawalla, its 40-year-old CEO, has spent nearly $1bn in recent years enlarging and improving the sprawling Pune campus.\nAs a result, when the coronavirus pandemic began to sweep across the world, the company, which recorded annual revenues of over $800mn in 2019-20 and is debt-free, was in pole position to reap the rewards.\nThe palm-fringed Pune campus, whose grounds boast horse-shaped topi","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-23T21:57:35","provider":{"name":"gulf-times","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://img.gulf-times.com/Content/Upload/Slider/1202123215732825789179.jpg","height":355,"width":620,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=639475264732318572","thumbnailHeight":177,"thumbnailWidth":309,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"gulf-times","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"http://gulf-times.com/story/683101/inside-the-world-s-biggest-vaccine-factory-india-s"}},{"id":"4869369532748888783","title":"Strong India following Netajis footsteps, from LOC to LAC: PM  Kashmir Reader","url":"https://kashmirreader.com/2021/01/23/strong-india-following-netajis-footsteps-from-loc-to-lac-pm/","description":"\n\n\n\n\nKolkata:PrimeMinister Narendra Modi on\n\nSaturday said that Netaji Subhas Chandra Bose would have been proud to see that the country has become strong and is following his footsteps from the Line of Control (LoC) to the Line of Actual Control (LAC).\n\n\n\nThe LoC divides Jammu and Kashmir between India and Pakistan, while the LAC separates India and China.\n\n\n\nBose would have also been","body":"Kolkata:Prime\nMinister Narendra Modi on\nSaturday said that Netaji Subhas Chandra Bose would have been proud to see that the country has become strong and is following his footsteps from the Line of Control (LoC) to the Line of Actual Control (LAC).\nThe LoC divides Jammu and Kashmir between India and Pakistan, while the LAC separates India and China.\nBose would have also been proud that the government he dreamt of is fighting a pandemic with vaccines developed by it, and gave a befitting reply whenever its sovereignty was challenged, Modi said on the occasion of the 125th birth anniversary of Netaji being celebrated by the Centre as Parakram Diwas.\nI sometimes wonder how Netaji would have felt if he had seen how a new and strong India is taking shape, he said at a programme held in the Victoria Memorial Hall here.\nNetaji had dreamt of strong India, from LAC to LOC we are following his footsteps. Whenever our sovereignty was challenged, we have given a befitting reply, he said while adding that country has a strong force and modern fighter aircraft such as Tejas and Rafale.\nStrong India following Netajis footsteps, from LOC to LAC: PM added by\nPress Trust of India","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-23T21:51:00","provider":{"name":"kashmirreader","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://kashmirreader.com/wp-content/uploads/2021/01/2021_1img23_Jan_2021_PTI01_23_2021_000299B-ll.jpg","height":172,"width":302,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=2018154817848621132","thumbnailHeight":96,"thumbnailWidth":168,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"kashmirreader","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://kashmirreader.com/2021/01/23/strong-india-following-netajis-footsteps-from-loc-to-lac-pm/"}},{"id":"3884184413325609760","title":"India following Neta Jis footsteps from LoC to LAC: PM","url":"https://www.dailyexcelsior.com/india-following-neta-jis-footsteps-from-loc-to-lac-pm/","description":"KOLKATA, Jan 23: Prime Minister Narendra Modi today said that Netaji Subhas Chandra Bose would have been proud to see that the country has become strong","body":"Print\nKOLKATA, Jan 23: Prime Minister Narendra Modi today said that Netaji Subhas Chandra Bose would have been proud to see that the country has become strong and is following his footsteps from the Line of Control (LoC) to the Line of Actual Control (LAC).\nThe LoC divides Jammu and Kashmir between India and Pakistan, while the LAC separates India and China.\nBose would have also been proud that the Government he dreamt of is fighting a pandemic with vaccines developed by it, and gave a befitting reply whenever its sovereignty was challenged, Modi said on the occasion of the 125th birth anniversary of Netaji being celebrated by the Centre as Parakram Diwas.\nI sometimes wonder how Netaji would have felt if he had seen how a new and strong India is taking shape, he said at a programme held in the Victoria Memorial Hall here.\nNetaji had dreamt of strong India, from LAC to LoC we are following his footsteps. Whenever our sovereignty was challenged, we have given a befitting reply, he said while adding that country has a strong force and modern fighter aircraft such as Tejas and Rafale. (PTI)","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-23T21:34:50","provider":{"name":"dailyexcelsior","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://www.dailyexcelsior.com/wp-content/uploads/2021/01/PM-Narendra-Modi-1200-1.jpg","height":800,"width":1200,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=3544525369188086571","thumbnailHeight":200,"thumbnailWidth":300,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"dailyexcelsior","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://www.dailyexcelsior.com/india-following-neta-jis-footsteps-from-loc-to-lac-pm/"}},{"id":"807117994677430824","title":"Kashmiris Roast Bollywood Director On Vegetarian Wazwaan","url":"https://thewestsidegazette.com/kashmiris-roast-bollywood-director-on-vegetarian-wazwaan/","description":"SRINAGAR, India  Wazwaan is not just a multi-course, non-vegetarian feast for wosti(Chef) Shafi Ahmad Khosa (60) who has been preparing delicious Kashmiri dishes for 35 years. It isnt a merely a matter of skill [...]","body":"on Kashmiris Roast Bollywood Director On Vegetarian Wazwaan\nSRINAGAR, India  Wazwaan is not just a multi-course, non-vegetarian feast for\nwosti\n(Chef) Shafi Ahmad Khosa (60) who has been preparing delicious Kashmiri dishes for 35 years. It isnt a merely a matter of skill either; it is a question of prestige.\nAnd when you ask him if wazwaan can be prepared with vegetables, he asks, do you mean herbs? a tad befuddled. He repeats the question to confirm if he has heard correctly.\nWhat on earth is a vegetarian wazwaan? he wonders.\nWell, Khosa has clearly not heard of Vivek Agnihotri, a Bollywood filmmaker who, on a recent visit to the Kashmir valley to shoot a film, suggested that Kashmiri cuisine was in need of a vegetarian makeover.\nNobody knows how to make a vegetarian wazwaan in Kashmir. But I am here to bring about change, Agnihotri wrote on his twitter handle. The tweet didnt go down well with Kashmiri netizens who are touchy when it comes to their culinary heritage and sparked strong reactions.\nIt was called out as an attempt of culinary colonialism.\nA culture is identified by its language and food and these aspects assume even more importance for a politically-sensitive, conflict ravaged region like Kashmir, explains Faizan Farooq, a research scholar based in Srinagar.\nIn Farooqs view, alteration of language and cuisine precedes the deeper-subjugation of a population.\nBe it Kemal Ataturk replacing Arabic script with Latin alphabets following his secularization of Turkey or the mass-scale production of European staple crops in Australia replacing the indigenous food of Aboriginals and Torres Strait islanders, cultural appropriation often precedes political subjugation, said Faizan.\nMeat being minced to prepare kebabs during a social ceremony in Srinagar (Hanan Zaffar)\nMany Kashmiris worry that I","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-23T21:30:32","provider":{"name":"thewestsidegazette","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://thewestsidegazette.com/wp-content/uploads/2021/01/Wazwaan-being-cooked-in-large-copper-utensils-called-degs-Hanan-Zaffar-1024x571-1.jpg","height":571,"width":1024,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=613171721039004145","thumbnailHeight":142,"thumbnailWidth":254,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"thewestsidegazette","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://thewestsidegazette.com/kashmiris-roast-bollywood-director-on-vegetarian-wazwaan/"}},{"id":"1041653053393178718","title":"Indian diaspora groups submit memo to Indian embassies across Europe, demand repeal of new farm laws  TwoCircles.net","url":"http://twocircles.net/2021jan23/440709.html","description":"TCN News Several Indian Diaspora groups across Europe submitted a common memorandumto Indian embassies in their respective countries of residence, demanding repeal of the three farm laws introduced by the BJP led government in India. The Diaspora laments the prolongation of the negotiations between farmers and elected officials, and assesses that the government's proposals have not been made in good faith' the statement issued by the groups reads. The three contentious agricultural reforms bills passed by Central government earlier in the month of August has stirred a great unrest among the Indian farmers, it poses a threat of corporatisation of","body":"Indian diaspora groups submit memo to Indian embassies across Europe, demand repeal of new farm laws\nJanuary 23, 2021\nTCN News\nSeveral Indian Diaspora groups across Europe submitted a common memorandum to Indian embassies in their respective countries of residence, demanding repeal of the three farm laws introduced by the BJP led government in India.\nSupport TwoCircles\nThe Diaspora laments the prolongation of the negotiations between farmers and elected officials, and assesses that the governments proposals have not been made in good faith the statement issued by the groups reads.\nThe three contentious agricultural reforms bills passed by Central government earlier in the month of August has stirred a great unrest among the Indian farmers, it poses a threat of corporatisation of agriculture and squanders the fundamental rights of the farmers. Since the bill got passed, farmers from Haryana, Punjab and all over the nation are demonstrating peaceful protests marching towards the capital, neither the curtailments of the police nor the government lowers their spirit.\nThe farmers have declared their intention to perform a revolutionary tractor parade as resistance on 26th January, 2021, Indias Republic Day, and there is so much anticipation in the air. And in the wake of such unconstitutional farm laws, leaders all over the world have extended their solidarity and criticised","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-23T21:12:13","provider":{"name":"twocircles","favIcon":"","favIconBase64Encoding":""},"image":{"url":"http://twocircles.net/wp-content/uploads/2021/01/images-1.jpg","height":575,"width":1024,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=4190337304345228158","thumbnailHeight":80,"thumbnailWidth":142,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"twocircles","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"http://twocircles.net/2021jan23/440709.html"}},{"id":"1076937005591783791","title":"Hindu traditions set in stone as Ganesha temple in Melbourne's east re-opens after renovations","url":"http://www.abc.net.au/news/2021-01-24/hindu-temple-reopens-after-major-renovations/13081574","description":"Devotees at a temple in Melbourne's east are in the midst of celebrations that occur once every 12 years, as its status as a holy site is restored with the return of sacred statues.","body":"Heavy lifting required to complete ancient shrines\nAs part of Hindu tradition, the temple is renovated, refurbished and reconsecrated every 12 years.\nThe new centrepiece of the temple this time around is a 17-layer, 350-tonne granite shrine to the elephant god Ganesha.\nSacred Hindu deities sit inside the new centrepiece shrine at the Ganesha temple.\n(\nABC News: Kristian Silva\n)\nThe shrine's dome, which sits outside on the temple roof, was carved from a single piece of granite weighing six tonnes, architect Purushothaman Jayaraman says.\nTen other smaller shrines around the temple are adorned with hand-carved elephants, peacocks, lions and lotuses. All the stones used in the renovations came from a quarry in Tamil Nadu in southern India.\nFor Mr Jayaraman, the temple has been a labour of love for three decades.\nHe was the original designer when the temple was built on the site of a disused Anglican church in the early 1990s, and he also planned renovations in 2007.\nThe Dravidian architectural designs he drew inspiration from date back thousands of years to temples in India and northern Sri Lanka. Many of the sculptures have been delicately chiselled by hand.\n\"We did this project with the help of 100 to 120 artists in India,\" he says of the latest works, adding that about 20 workers were flown to Australia to complete the job.\n\"One week before the pandemic started we luckily landed here. That's why we were able to finish this project on time,\" he says.\nArchitect Purushothaman \"Puru\" Jayaraman is an expert designer of Dravidian temples.\n(\n)\nTemple's rise as community grows\nThe temple's grand reopening, which will take place on Monday, will be a more subdued affair than when a Hindu temple is normally reconsecrated.\nA woman prays to a deity after the rare opportunity to apply oil to it.\n(\n)\nAbout 2,000 people will attend, but their arriva","keywords":"","language":"en","isSafe":false,"datePublished":"2021-01-23T20:28:50","provider":{"name":"abc","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://www.abc.net.au/cm/rimage/13083286-16x9-large.jpg?v=2","height":394,"width":700,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=1791762887784152523","thumbnailHeight":110,"thumbnailWidth":195,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"abc","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"http://www.abc.net.au/news/2021-01-24/hindu-temple-reopens-after-major-renovations/13081574"}},{"id":"2578184732972326145","title":"WWE Superstar Spectacle Spoilers: Indian Stars Celebrate Republic Day","url":"https://www.prowrestling.com/wwe-superstar-spectacle-spoilers/","description":"WWE taped five matches and several segments at the ThunderDome on Friday for their upcoming Superstar Spectacle event. The show will air on Tuesday, January 26 to coincide with Indias Republic Day, streaming throughout the country on Sony television stations as well as internationally on the WWE Network. Thanks to ITNWWE.com for results. The show []","body":"Mike Killam\nOwens Stuns The Tribal Chief\nThe Friday Night Smackdown main event was supposed to feature Adam Pierces return to the ring against the special counsel of the Tribal Chief, Paul Heyman. Instead, it turned into another wild brawl between Universal Champion Roman Reignsand Kevin Owens, with the later finally getting a measure of revenge. Owens delivered not one, but two stunners before driving Reigns through the announce table with a pop-up powerbomb.\nThe Conspiracy Against Sami Zayn\nSami Zayn continued his quest to reveal a conspiracy at the heart of WWE once again this week, bringing his documentary crew to ringside as he handcuffed himself to the barricade for a good chunk of the show. Zayn remained that way until jumping both Big E and Apollo Crews during an Intercontinental Championship defense, causing the match to end in a No Contest.\nBelair Overcomes All Obstacles\nThe rivalry between Bayleyand Bianca Belair continued this week as the two Superstars faced off in an obstacle course obviously meant to play off Belairs athletic background.\nBayley\ns course was much, much easier than her opponents as she simply ranaroundsome of the obstacles. Not only did Belair complete a more difficult course, including hurdles, climbing walls, and legitimately carrying Otis on her back, but she still somehow managed to beat\ns time.\nCesaros Momentum Continues\nCesaro is undeniable on a hot streak. The Swiss Superman used the momentum of his somewhat surprise singles victory over Daniel Bryan last week to propel him to yet another win this Friday night on Smackdown; this time over one half of the Smackdown Tag Team Champions in Dolph Ziggler. Cesaro has officially declare","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-23T20:16:26","provider":{"name":"prowrestling","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://www.prowrestling.com/wp-content/uploads/2021/01/wwe-superstar-spectacle-india-2021-1000x600.jpg","height":600,"width":1000,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=4740184801299810453","thumbnailHeight":112,"thumbnailWidth":186,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"prowrestling","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://www.prowrestling.com/wwe-superstar-spectacle-spoilers/"}},{"id":"1145466184942169483","title":"Understanding shoulder injury related to vaccination","url":"https://www.navhindtimes.in/2021/01/24/magazines/panorama/understanding-shoulder-injury-related-to-vaccination/","description":"Nandkumar M Kamat WHO team has begun its investigative work in China on COVID-19 and it will continue it by making several visits this year to discover the closest relative of the virus in bats. The team is expected to gather data on where and how COVID-19 jumped to humans and whether another species acted []","body":"WhatsApp\nNandkumar M Kamat\nWHO team has begun its investigative work in China on COVID-19 and it will continue it by making several visits this year to discover the closest relative of the virus in bats. The team is expected to gather data on where and how COVID-19 jumped to humans and whether another species acted as an intermediate host. This investigation is expected to provide clues to prevention of other pandemic viruses from emerging.\nOn the other side, we see much euphoria about the anti COVID-19 vaccination programme but the scientific community is not very satisfied with the lack of transparency. We dont have in India a fund like the USA that compensates people injured by vaccines. In the USA they have a $4 billion fund to compensate people if they sustain shoulder injuries after incorrectly administered injections with flu, tetanus, and other vaccines.\nSince the publication of a paper by a team of American scientists led by Major Szari in August 2019 titled Shoulder Injury Related to Vaccine Administration: A Rare Reaction there had been more claims that other vaccines also caused shoulder injuries. This team had advised that there needs to be proper awareness of shoulder injury related to vaccine administration and a high index of suspicion are\nnecessary to evaluate patients with shoulder concerns post vaccination.\nSince after China it would be India which would see large mass anti COVID-19 vaccination drives it is important to know their findings so that there is no panic caused if cases of SIRVA (Shoulder Injury Related to Vaccine Administration) are found.\nIn the USAin 2010, SIRVA was described by Atanasoff and colleagues as the rapid onset of shoulder pain and dysfunction persisting as a com","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-23T19:53:00","provider":{"name":"navhindtimes","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://www.navhindtimes.in/wp-content/uploads/2021/01/Nandu-2.jpg","height":1366,"width":2048,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=5367539771566715908","thumbnailHeight":85,"thumbnailWidth":127,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"navhindtimes","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://www.navhindtimes.in/2021/01/24/magazines/panorama/understanding-shoulder-injury-related-to-vaccination/"}},{"id":"7594599453110632253","title":"Ageing dams in India pose growing threat: UN report","url":"https://www.greaterkashmir.com/news/todays-paper/ageing-dams-in-india-pose-growing-threat-un-report/","description":"Ageing dams in India pose growing threat: UN report Greater Kashmir | Over a thousand large dams in India will be roughly 50 years old in 2025 and such aging embankments across the world pose a growing threat, according to a","body":"Ensure timely snow clearance, power restoration: Congress tells Govt\nIn India, there are over 1,115 large dams that will be roughly 50 years old in 2025, more than 4,250 large dams in the country will be over 50 years old in 2050 and 64 large dams will be more than 150 years old in 2050, it said.\nThe report said that approximately 3.5 million people are at risk if Indias Mullaperiyar dam in Kerala, built over 100 years ago, were to fail.\nThe dam, in a seismically active area, shows significant structural flaws and its management is a contentious issue between Kerala and Tamil Nadu States, it said.\nThe report added that dams that are well designed, constructed and maintained can easily reach 100 years of service but predicts an increase in decommissioning  a phenomenon gaining pace in the USA and Europe  as economic and practical limitations prevent ageing dams from being upgraded or if their original use is now obsolete.","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-23T19:47:01","provider":{"name":"greaterkashmir","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://i0.wp.com/www.greaterkashmir.com/wp-content/uploads/2021/01/united-nations.jpg?fit=800%2C500&#038;ssl=1","height":500,"width":800,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=1050266118245686197","thumbnailHeight":187,"thumbnailWidth":299,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"greaterkashmir","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://www.greaterkashmir.com/news/todays-paper/ageing-dams-in-india-pose-growing-threat-un-report/"}},{"id":"2841055417805364335","title":"Scientists find two new species of rare ant in Kerala, Tamil Nadu","url":"http://deccanchronicle.com/science/science/230121/scientists-find-two-new-species-of-rare-ant-in-kerala-tamil-nadu.html","description":"In India, the genus was so far represented by two species with nine and 11-segmented antennae respectively","body":"Scientists find two new species of rare ant in Kerala, Tamil Nadu\nPTI\nJan 23, 2021, 7:05 pm IST\nUpdated\nJan 23, 2021, 7:05 pm IST\nIn India, the genus was so far represented by two species with nine and 11-segmented antennae respectively\nOne of the two species found in the Periyar Tiger Reserve of Kerala has been named Ooceraea Joshii in honour of professor Amitabh Joshi -- a distinguished evolutionary biologist from Jawaharlal Nehru Centre for Advanced Scientific Research (JNCASR), a DST institute. (Image:pib.gov.in)\nNew Delhi: Two new species of a rare ant genus have been discovered in Kerala and Tamil Nadu by a team of scientists, the Department of Science and Technology said on Saturday.\nThe team was led by Himender Bharti of Punjabi University in Patiala.\n\nOne of the two species found in the Periyar Tiger Reserve of Kerala has been named Ooceraea Joshii in honour of professor Amitabh Joshi -- a distinguished evolutionary biologist from Jawaharlal Nehru Centre for Advanced Scientific Research (JNCASR), a DST institute.\n\"The species of the ant genus Ooceraea found in Kerala and Tamil Nadu add to the diversity of this rare genus. They differ from others of the same genus on the basis of the number of antennal segments,\" the DST said.\nNew species are typically named after some distinguishing attribute or location but are often named after scientists as a means of honouring their research contributions to biology, especially in the fields of evolutionary and organismal biology, ecology or systematics.\n\n\"The two new species, the first ones spotted with 10-segmented antennae among this rare genus, were discovered by a team led by Prof. Himender Bharti of Punjabi University, Patiala. The discovery has been published in the journal ZooKeys,\" the DST added.\nThe genus is currently represented by 14 species of which eight possess nine-segmented antennae, while five possess 11-segmented antennae and one species has","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-23T19:05:00","provider":{"name":"deccanchronicle","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://s3.ap-southeast-1.amazonaws.com/images.deccanchronicle.com/dc-Cover-uch5o4g6mal86aeru1qocum9a3-20210123190306.Medi.jpeg","height":448,"width":800,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=1469522843281328667","thumbnailHeight":168,"thumbnailWidth":300,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"deccanchronicle","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"http://deccanchronicle.com/science/science/230121/scientists-find-two-new-species-of-rare-ant-in-kerala-tamil-nadu.html"}},{"id":"4161657564954162","title":"Indian govt says over 300,000 people vaccinated against COVID-19 in single day","url":"https://www.bernama.com/en/general/news_covid-19.php?id=1925034","description":"India, Covid-19, vaccine","body":"bootstrap slideshow\n23/01/2021 07:04 PM\nNEW DELHI, Jan23 -- The Indian government on Saturday said over 300,000 people were vaccinated against the COVID-19 in a single day for the first time since the beginning of inoculation drive last week.\nThe highest number of vaccinations so far was carried out on Friday, Xinhua news agency reported.\n\"In the last 24 hours, 347,058 people were vaccinated across 6,241 sessions,\" the federal health ministry said.\nbootstrap slideshow\nAccording to the ministry, so far nearly 1.4 million beneficiaries have received COVID-19 shots.\n\"As on 23rd January 2021, till 8am(local time) nearly 14 lakh (13,90,592) beneficiaries have received the vaccination,\" the ministry said.\nOfficials say the inoculations have been conducted during 24,408 sessions held across the country.\nOn Thursday federal Health Minister Harsh Vardhan said COVID-19 vaccines were completely safe and effective and these vaccines will prove to be the last nail in the coffin of the COVID-19 disease.\nThe inoculation drive against COVID-19 across India began on Jan16.\nInitially, around 30 million healthcare and frontline workers will be vaccinated, followed by those above 50 years of age and the under-50 population groups with co-morbidities numbering around 270 million.\nReports said Indian Prime Minister Narendra Modi and chief ministers of states will be vaccinated against COVID-19 in the second phase of vaccination drive that will start in March or April.\n-- BERNAMA","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-23T19:04:00","provider":{"name":"bernama","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://www.bernama.com/storage/photos/133248dc30d5522a451c739b7d69ff4c6003c6986cf23","height":694,"width":1110,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=4878810734493305875","thumbnailHeight":96,"thumbnailWidth":153,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"bernama","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://www.bernama.com/en/general/news_covid-19.php?id=1925034"}},{"id":"4024812506571880181","title":"Hockey Women: Argentina 'B' beat India 2-1","url":"https://www.netindian.in/news/sports/hockey-women-argentina-b-beat-india-2-1","description":"India conceded a late goal to go down 1-2 to Argentina 'B' Women's  hockey team at Cenard here today.","body":"23 Jan, 2021 , 6:31 pm\nBuenos Aires, January 23, 2021\nIndia conceded a late goal to go down 1-2 to Argentina 'B' Women's  hockey team at Cenard here today.\nSol Pagella (11') and Agustina Gorzelany (57') scored for the home team while young forward Salima Tete (54') was the lone goalscorer for India.\nIn the previous matches, the visiting side had drawn 2-2 and 1-1 respectively against the Argentina Junior Women.\n\"Today we played against a stronger Argentina squad consisting many of their senior players. This was a perfect practice match for us ahead of next week's schedule where we play against the Senior side. Unfortunately, we conceded a PC goal minutes before the regulation time and this is what we need to manage better,\" said India's Chief Coach Sjoerd Marijne.\nIndia began on the backfoot with Argentina 'B' playing tough and attacking hockey right from the start. Conceding two back-to-back penalty corners within six minutes of play put pressure on the visiting side but the Indian goalkeeper Rajani did well to save the goals. In the 11th minute, however, a fierce circle penetration and well-timed strike by younger Sol Pagella put the home team ahead by 1-0.\nWith a strong defence put up by the Argentinian women, PCs were hard to come by for India and circle entries were restricted too. Though India managed to earn a PC in the 23rd minute, dragflicker Gurjit Kaur's attempt to equalise was well saved by the opposition's goalkeeper.\nIt was a battle India had to fight hard against a strong Argentinian forward line as they earned two more PCs in the 43rd and 51st minutes. But India's PC defence held sway to ensure the lead was not further extended. In the 54th minute, when India bagged a PC, an alert Salima Tete swiftly struck the ball off a rebound into the goalpost fetching her team a much-need equaliser.\nThe sturdy home team upped their ante in the following minutes with a circle penetration that resulted in a P","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-23T18:31:54","provider":{"name":"netindian","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://gumlet.assettype.com/netindian%2F2021-01%2Ff0d9c00f-72e7-48f4-bd6a-4f9320a6ca88%2FSalima_Tete_celebrates_goal.JPG?rect=0%2C73%2C2400%2C1260&amp;w=1200&amp;auto=format%2Ccompress&amp;ogImage=true","height":1260,"width":2400,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=4213473590248946429","thumbnailHeight":117,"thumbnailWidth":222,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"netindian","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://www.netindian.in/news/sports/hockey-women-argentina-b-beat-india-2-1"}},{"id":"2864298805994680960","title":"The New York Times Partner, Latest news of Nepal in English, Latest News Articles","url":"http://myrepublica.com/news/modi-says-india-self-reliant-on-covid-19-vaccines-as-1-million-inoculated/","description":"NEW DELHI, Jan 23:Prime Minister Narendra Modi said on Friday India was completely self-reliant on coronavirus vaccine supplies as the worlds second-most populous country inoculated more than 1 million people within a week of starting its campaign.","body":"@RepublicaNepal\nFILE PHOTO: A woman walks past a painting of Indian Prime Minister Narendra Modi a day before the inauguration of the COVID-19 vaccination drive on a street in Mumbai, India, January 15, 2021. REUTERS/Francis Mascarenhas/File Photo\nNEW DELHI, Jan 23:Prime Minister Narendra Modi said on Friday India was completely self-reliant on coronavirus vaccine supplies as the worlds second-most populous country inoculated more than 1 million people within a week of starting its campaign.\nOn Saturday, India began what the government calls the worlds biggest vaccination programme, using two shots made locally: one licensed from Oxford University and AstraZeneca Plc, and another developed at home by Bharat Biotech in partnership with the state-run Indian Council of Medical Research.\nOur preparation has been such that vaccine is fast reaching every corner of the country, Modi said on a video call with healthcare workers.\nAnd on the worlds biggest need today, we are completely self-reliant. Not just that, India is also helping out many countries with vaccines.\nIndia, known as the pharmaceutical capital of the world, has gifted vaccines to neighbours and partners such as Bangladesh, Nepal, Bhutan, Seychelles, Mauritius and the Maldives. It is starting commercial shipments to Brazil and Morocco on Friday.\nThe U.S. State Department praised the Indian effort.\nWe applaud Indias role in global health, sharing millions of doses of COVID-19 vaccine in South Asia, it said on Twitter. Indias a true friend using its pharma to help the global community.\nEarlier this week, the head of the World Health Organization urged countries and manufacturers to spread vaccines more fairly around the world, and warned that the world was on the brink of catastrophic moral failure if it did not","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-23T18:10:00","provider":{"name":"myrepublica","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://myrepublica.nagariknetwork.com/uploads/media/India_20210123171156.JPG","height":423,"width":819,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=2332909785154895389","thumbnailHeight":118,"thumbnailWidth":228,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"myrepublica","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"http://myrepublica.com/news/modi-says-india-self-reliant-on-covid-19-vaccines-as-1-million-inoculated/"}},{"id":"4127708923290473072","title":"Faf understands the significance of anti-GBV stance taken by Proteas women","url":"http://news24.com/sport/cricket/proteas/faf-understands-the-significance-of-anti-gbv-stance-taken-by-proteas-women-20210123","description":"Former Proteas captain Faf du Plessis understands the significance of the anti-gender-based violence stance taken by the women's team.","body":"Faf du Plessis\nAshley Vlotman/Gallo Images\nFormer Proteas captain Faf du Plessis understands the significance of the anti-GBV stance taken by the women's team.\nThe women's team played in black against Pakistan at Kingsmead on Saturday in solidarity with GBV victims.\nDu Plessis also said Pakistan will be difficult to beat on their own patch.\nProteas star batsmanFaf du Plessis may understand the significance of touring in Pakistan for the first time, but the stand the Proteas women have taken with regards to gender-based violence (GBV) isn't lost on him.\nThe Proteas women defeated Pakistan by 13 runsin Saturday's second ODI, which saw South Africa wear black in solidarity with GBV victims.\nA visibly fresh and relaxed Du Plessis, who will be playing his first Test in Pakistan, was firm in how GBV was a problem in South Africa.\n\"GBV isn't just a women problem in our country, it is a South African problem, especially for males. If you look at the GBV stats in South Africa, they are insane. They are ridiculous,\" said Du Plessis.\n\"One of the most important things in our country, that as males, we need to be better, that our country becomes more aware of what is going on and how bad the situation is.\n\"The more you speak about it, the more your mouth drops open with regards to what is happening. It is a great cause and one that I'm happy to support. It's great to see the ladies doing their thing and playing in black.\"\nWith the first Test taking place in Karachi, a fortress of Pakistani cricket that's only been breached by South Africa (2007) and England (2000), the visitors still have a tough task in front of them.\nBetween 2007, when they won the two-Test series against Pakistan 1-0 and 2015 when they were hammered 3-0 in a four-match series, South Africa were one of the best travelling sides in Asia.\nThere were two notable series draws in India and a series win in Sri Lanka 2014, but th","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-23T18:01:14.847","provider":{"name":"news24","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://cdn.24.co.za/files/Cms/General/d/10631/17e35b39760d40a68eab396f76d9e8b3.png","height":430,"width":650,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=6699833215887006911","thumbnailHeight":215,"thumbnailWidth":325,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"news24","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"http://news24.com/sport/cricket/proteas/faf-understands-the-significance-of-anti-gbv-stance-taken-by-proteas-women-20210123"}},{"id":"8682962219985281674","title":"Vaccine ready for roll-out","url":"https://www.thedailystar.net/editorial/news/vaccine-ready-roll-out-2032765","description":"Having received the first consignment of 20 lakh doses of Covishield vaccine as a gift from Indiaalong with the purchase of three crore doses from the Serum Institute of India, of which 50 lakh doses are expected to arrive tomorrowPrime Minister Sheikh Hasina will inaugurate the Covid-19 vaccination programme virtually at the Kurmitola General Hospital on Wednesday. A nurse","body":"12:00 AM, January 24, 2021 / LAST MODIFIED: 01:00 AM, January 24, 2021\nEditorial\nVaccine ready for roll-out\nBut have we prepared the essential priority-based recipients list?\nA nurse displays a vial of AstraZeneca's Covishield vaccine during a vaccination campaign in Mumbai. Photo: Reuters/Francis Mascarenhas\nHaving received the first consignment of 20 lakh doses of Covishield vaccine as a gift from Indiaalong with the purchase of three crore doses from the Serum Institute of India, of which 50 lakh doses are expected to arrive tomorrowPrime Minister Sheikh Hasina will inaugurate the Covid-19 vaccination programme virtually at the Kurmitola General Hospital on Wednesday. A nurse at the hospital will be the first person to be vaccinated on that day. Later, the piloting will take place across several public hospitals. The vaccination campaign will begin in Dhaka and then will be introduced elsewhere gradually. Each vaccination team will have six members, two vaccinators and four volunteersthe vaccinators will be assigned from the nurses or Sub-Assistant Community Medical Officers (SACMO), while respective officials of vaccination centres will recruit volunteers locally. Health professionals and volunteers are currently being trained for the inoculation campaign.\nWhile this is surely good news for all, we are worried that the government is yet to finalise the list of healthcare professionals and volunteers to be part of the Covid-19 mass inoculation campaign. Needless to say, it would have been an astute approach to keep the list ready as the vaccination programme has been in discussion for quite some time now. According to health officials, th","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-23T18:00:00","provider":{"name":"thedailystar","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://assetsds.cdnedge.bluemix.net/sites/default/files/styles/social_share/public/feature/images/2021/01/24/astrazenecas-covishield-vaccine.jpg?itok=Xdvr0eDy","height":292,"width":560,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=315105800473960638","thumbnailHeight":146,"thumbnailWidth":280,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"thedailystar","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://www.thedailystar.net/editorial/news/vaccine-ready-roll-out-2032765"}},{"id":"2502099906952277161","title":"India, China To Hold 9th Round Of Military Talks On January 24","url":"https://www.moneycontrol.com/news/current-affairs/india-china-to-hold-9th-roundmilitary-talksjanuary-24_14703321.html","description":"India has all along been maintaining that the onus is on China to carry forward the process of disengagement and de-escalation at the friction points in the mountainous region.","body":"PM Modi, Mamata Banerjee claim Netaji's legacy, fight over his 'parakram' and 'patriotism'\nNearly 50,000 troops of the Indian Army are deployed in a high state of combat readiness in various mountainous locations in eastern Ladakh in sub-zero temperatures as multiple rounds of talks between the two sides have not yielded concrete outcome to resolve the standoff. China has also deployed an equal number of troops, according to officials.\nLast month, India and China held another round of diplomatic talks under the framework of the Working Mechanism for Consultation and Coordination (WMCC) on India-China border affairs. However, no concrete outcome emerged from the talks.\nFollowing the sixth round of military talks on September 21, the two sides had announced a slew of decisions including not to send more troops to the frontline, refrain from unilaterally changing the situation on the ground and avoid taking any actions that may further complicate matters.\nThis round was held with a specific agenda of exploring ways to implement a five-point agreement reached between External Affairs Minister S Jaishankar and his Chinese counterpart Wang Yi at a meeting in Moscow on September 10 on the sidelines of a Shanghai Cooperation Organisation(SCO) conclave.\nThe pact included measures like quick disengagement of troops, avoiding action that could escalate tensions, adherence to all agreements and protocols on border management and steps to restore peace along the LAC.\nPTI\n#China                       #Current Affairs                       #India                       #Ladakh\nfirst published: Jan 23, 2021 10:56 pm\nWatch\nExplained | Is it time for India to increase its defence budget for 2021-22?   Watch more\nExplained | Sensex hits 50k milestone: Here is what led to the rally   Watch more\nIdeas For Profit | Hamara Bajaj: Strong export demand of two-whe","keywords":"","language":"en","isSafe":false,"datePublished":"2021-01-23T17:26:37","provider":{"name":"moneycontrol","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://images.moneycontrol.com/static-mcnews/2020/09/Ladakh_border-770x433.jpg","height":433,"width":770,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=5415677518380494033","thumbnailHeight":188,"thumbnailWidth":336,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"moneycontrol","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://www.moneycontrol.com/news/current-affairs/india-china-to-hold-9th-roundmilitary-talksjanuary-24_14703321.html"}},{"id":"308187246199583684","title":"SBI conducts Blood Donation Camps across the country","url":"https://orissadiary.com/sbi-conducts-blood-donation-camps-across-the-country/","description":"Mumbai: Countrys largest lender, State Bank of India (SBI), conducted nation-wide Blood Donation Camps. This initiative, led by Stressed Assets Resolution Group (SARG)  a vertical of SBI &#","body":"WhatsApp\nMumbai: Countrys largest lender, State Bank of India (SBI), conducted nation-wide Blood Donation Camps. This initiative, led by Stressed Assets Resolution Group (SARG)  a vertical of SBI  was virtually inaugurated by Shri Dinesh Kumar Khara, Chairman.\nThe camps setup pan-India at 40 centres in association with Indian Red Cross Society, collected 2360 units of blood. The camps witnessed employees of the bank along with their families and people at large, voluntarily donating blood for a noble cause of saving lives. The Circle Management Committee members of all Circles extended full co-operation to the SARG at their respective Centres.\nShri Ashwani Bhatia, MD (GB&S, CCG, IT & Risk), Shri S. Salee, DMD (SARG), Ms. Shabnam Narayan, CGM (SARG) and Shri Krishan Singh Barguzar, CGM (Non-Infra), SARG were also present at the inauguration of the blood donation camps.\nShri Dinesh Khara, Chairman SBI said, We are pleased to be associated with Indian Red Cross Society and be a part of this life saving initiative. Organizing blood donation camps is a crucial event and I feel we should conduct such camps on a regular basis. We would also like to thank all the participants across the country who came forward to donate blood specially in these difficult pandemic times.\n\nDuring the blood donation camps, the bank staff also ensured that Covid protocols were adhered to.\n","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-23T16:52:40","provider":{"name":"orissadiary","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://i2.wp.com/orissadiary.com/wp-content/uploads/2021/01/Image-2-Inauguration-of-Blood-Donation-Camps.jpg?fit=694%2C276&amp;ssl=1","height":276,"width":694,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=8783200573107787658","thumbnailHeight":103,"thumbnailWidth":258,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"orissadiary","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://orissadiary.com/sbi-conducts-blood-donation-camps-across-the-country/"}},{"id":"6454325163091903175","title":"IND Vs ENG: Ahead Of India-England Series, Kevin Pietersen Shares Rahul Dravid's Tips On Playing Spin Bowling","url":"http://outlookindia.com/website/story/sports-news-ind-vs-eng-ahead-india-england-series-kevin-pietersen-shares-rahul-dravids-tips-on-playing-spin/371628","description":"Sharing the email sent to him by Rahul Dravid in 2017, Kevin Pietersen urged ECB to give it to the struggling duo of Dom Sibley and Zak Crawley","body":"Rahul Dravid and Kevin Pietersen\nPTI\n2021-01-23T22:15:28+05:30\nIND Vs ENG: Ahead Of India-England Series, Kevin Pietersen Shares Rahul Dravid's Tips On Playing Spin Bowling\noutlookindia.com\n2021-01-23T22:41:25+05:30\nWith England set to tour India, former captain Kevin Pietersen on Saturday shared tips on how to go about tackling quality spin bowling given to him by Rahul Dravid some years ago. (\nMore Cricket News\n)\nSharing the email sent to him by the Indian batting great in 2017, Pietersen urged the England & Wales Cricket Board (ECB) to give it to struggling duo of Dom Sibley and Zak Crawley.\nEngland openers Sibley and Crawley, who have been named in the squad for the upcoming Test series in India, have been struggling against left-arm Sri Lanka spinner Lasith Embuldeniya, who took their wickets in both the first and second Test of the ongoing series.\nSharing two pages of the email sent to him by Dravid, Pietersen wrote on his twitter handle: \"Hey @englandcricket, print this and give it to Sibley & Crawley. They can call me to discuss it at length if they want.\"\nHey @englandcricket print this and give it to Sibley & Crawley.\nThey can call me to discuss it at length if they want...!","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-23T16:45:28","provider":{"name":"outlookindia","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://www.outlookindia.com/public/upload_share/website/Dravid-KP_371628.jpg","height":326,"width":650,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=329525554687677000","thumbnailHeight":163,"thumbnailWidth":325,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"outlookindia","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"http://outlookindia.com/website/story/sports-news-ind-vs-eng-ahead-india-england-series-kevin-pietersen-shares-rahul-dravids-tips-on-playing-spin/371628"}},{"id":"2319051712207502004","title":"Cricket: England urged to 'rethink' India selection decision by Nasser Hussain","url":"https://metro.co.uk/2021/01/23/cricket-news-england-urged-rethink-india-selection-decision-nasser-hussain-13955156/","description":"Nasser Hussain believes England should 'rethink' their decision to rest Jonny Bairstow for the first two Tests against India. Bairstow scored 47 and 35 not out in England's victory over...","body":"Copy link\nNasser Hussain has been impressed with England star Jonny Bairstow in Sri Lanka (Picture: Getty)\nNasser Hussain believes England should rethink their decision to rest Jonny Bairstow for the first two Tests against India.\nBairstow scored 47 and 35 not out in Englands victory over Sri Lanka in the first Test in Galle last week, and is currently 24 not out in the first innings of the second match.\nThe decision has already been made for Bairstow to miss the first and second Tests of Englands series against India, which starts on February 5, as the ECB look to give every player enough rest in a bumper year which includes 17 Test matches and a T20 World Cup\nAdvertisement\nAdvertisement\nBut former captain Hussain says a rethink may be wise given Bairstow has impressed in subcontinental conditions. England have often struggled in India and will be coming up against a team who pulled off an extraordinary 2-1 victory in Australia recently.\nHussain told\nSky Sports\n: I would say its a concern that one of Englands best three players of spin  I would say Bairstow is alongside Joe Root and Ben Stokes in that  has been given a boarding pass home and the others are going to Chennai. Id have to rethink.\nIt must be an absolute nightmare what the players have been through [during these Covid times]  they had the whole of last summer and then had the IPL. Then it was South Africa, now Sri Lanka, then India and then IPL again.\nI get that and I am not downplaying it at all  it must be a nightmare for the selectors  but should you have your best side for that first India Test?\nShould you be resting or rotating for India or do you turn up to the first Test of that India series, an iconic series, and pick your best side?\nEngland fans switching on when it is turning and England are 20-2 may well have the argument, I want to see our best batsma","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-23T16:32:07","provider":{"name":"metro","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://i2.wp.com/metro.co.uk/wp-content/uploads/2021/01/GettyImages-1271961420-1_1611419641.jpg?quality=90&amp;strip=all&amp;w=1200&amp;h=630&amp;crop=1&amp;zoom=1&amp;ssl=1","height":630,"width":1200,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=4034123607585595158","thumbnailHeight":176,"thumbnailWidth":337,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"metro","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://metro.co.uk/2021/01/23/cricket-news-england-urged-rethink-india-selection-decision-nasser-hussain-13955156/"}},{"id":"3911200894114797685","title":"UK coronavirus daily death toll rises by 1,348 with 153 per cent rise in just two weeks","url":"https://www.mirror.co.uk/news/uk-news/breaking-uk-coronavirus-death-toll-23372544","description":"\n The tragic figure was announced by the Department of Health as the UK's Covid death toll nears 100,000. Just four countries, the USA, Brazil, Mexico and India, have seen more fatalities due to Covid-19\n","body":"Welsh Tory leader Paul Davies quits after drinking despite lockdown alcohol ban\nScientists have warned there can be no early easing of lockdown restrictions, and the Prime Minister appealed to people to stay home and follow the rules.\nProfessor Chris Whitty said last night there were early signs that hospitalisations are beginning to come down in the south east, east of England and London.\nBut new hospital cases were still rising in the Midlands and north, the Chief Medical Officer warned the Downing Street press conference.\nAnd a SAGE paper published on Friday suggested that even if new hospital admissions come down, it will take weeks for the number of occupied beds to fall.\nA total of 5,526,071 Covid-19 vaccinations had taken place in England between December 8 and January 22, according to provisional NHS England data, including first and second doses, which is a rise of 425,596 on Friday's figures.\nOf this number, 5,085,771 were the first dose of the vaccine, a rise of 424,478 on Friday's figures, while 440,300 were the second dose, an increase of 1,118.\nDailyMirror","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-23T16:08:14","provider":{"name":"mirror","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://i2-prod.mirror.co.uk/incoming/article23370957.ece/ALTERNATES/s1200/0_Prime-Minister-Boris-Johnson-Hospitalized-Due-To-Coronavirus-Infection.jpg","height":630,"width":1200,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=5191397847971437836","thumbnailHeight":157,"thumbnailWidth":299,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"mirror","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://www.mirror.co.uk/news/uk-news/breaking-uk-coronavirus-death-toll-23372544"}},{"id":"1327729725708617542","title":"When life throws a curveball...consider steak","url":"https://www.stuff.co.nz/life-style/food-to-love/123563707/when-life-throws-a-curveballconsider-steak.html","description":"Tejas Nikam was about to return to India when a phone call lead him to launching a steak house in Hamilton.","body":"Cafe Chat: Park Ranger opens central Christchurch location\nNikam, who is in his mid-30s, laughs at the idea now.\nWhile in limbo, he got a call about Paddock to Plate a new restaurant venture in Hamilton's main street.\nWould he be interested?\nAs a Beef + Lamb ambassador, opening a steak house is the best thing you can choose, he said.\nOwners Leonard Gardner, of Foster Construction, and Lalit Kumar, of Iguana Street Bar & Restaurant, knew just what they wanted.\nAs well as being a steak house  Kiwis love steak  Paddock to Plate has strong support from local kaupapa.\nMARK TAYLOR/Stuff\nPaddock to Plate Waikato is in the former site of Bluestone Steakhouse, in Hamilton's main street.\n\"All my meats we're sourcing locally. Everything is from the Waikato, most of the beverages, even the cheese and stuff, ice creams.\"\nThere's tea from Zealong Estate where Nikam got his first New Zealand head chef job, Duck Island ice cream, and beer and wines from Lake Karapiro's Takapoto Estate.\nNikam is about taking simple ingredients.  Forgoing trendy foams in favour of Asian flavours and fresh herbs .\nI think the most important thing is the quality of the product for me. If something you're getting on your doorstep is good quality, then you don't need to go anywhere else.\nPerhaps unsurprisingly for a Beef + Lamb ambassador at the helm of a steak house, he chose to showcase a sirloin in his summer recipe for Stuff.\nMARK TAYLOR/Stuff\nNikam's summer recipe for Stuff is grilled sirloin with baby cos, cherry tomato and salsa verde.\nPaddock to Plate opened in September, after pushing back the date due to Covid-induced uncertainty.\nThe new venture has slotted straight into a spot local meat-lovers may recognise, with its stone features and wooden wall panels and bar.\nIt's the former Bluestone Steakhouse site, in a building earmarked for the Waikato Regional Theatre development\nThe restaurant is temporary, Nikam said, but those behind ","keywords":"","language":"en","isSafe":false,"datePublished":"2021-01-23T16:00:00","provider":{"name":"stuff","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://resources.stuff.co.nz/content/dam/images/4/y/p/r/u/b/image.related.StuffLandscapeSixteenByNine.1420x800.21ked7.png/1611175144379.jpg","height":798,"width":1420,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=7309769189756101182","thumbnailHeight":199,"thumbnailWidth":354,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"stuff","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://www.stuff.co.nz/life-style/food-to-love/123563707/when-life-throws-a-curveballconsider-steak.html"}},{"id":"5032936732436648378","title":"India news: Farmers say police have approved Republic Day tractor rally, and other top headlines","url":"https://scroll.in/latest/984926/the-big-news-farmers-say-police-have-approved-republic-day-tractor-rally-and-9-other-top-stories","description":"Other headlines: Mamata Banerjee refused to speak at Modi event in Kolkata, and Brazil president tweeted image of Hanuman to thank India for vaccines.","body":"quick reads\nThe big news: Farmers say police have approved Republic Day tractor rally, and 9 other top stories\nOther headlines: Mamata Banerjee refused to speak at Modi event in Kolkata, and Brazil president tweeted image of Hanuman to thank India for vaccines.\nScroll Staff\n34 minutes ago\nFarmers take out a tractor march as part of the preparations for their planned tractor parade in Delhi on Republic Day, during a protest against the new farm laws, in Amritsar, on Friday.                  |          PTI\nA look at the headlines right now:\nDelhi Police allows Republic Day tractor rally say farmers; farm unions appeal for calm: Swaraj India chief Yogendra Yadav said they will hold a historical and peaceful parade that will not come in the way of the Republic Day parade. Meanwhile, farmers at Singhu Border captured a man allegedly sent to kill protesting farmer leaders\nMamata Banerjee refuses to speak at Modi event\nfor Netaji after Jai Shri Ram chants: Narendra Modi was in Kolkata on Saturday to mark freedom fighter Subhas Chandra Boses 125th birth anniversary. Earlier in the day, she criticised the event saying Trinamool Congress did not celebrate the freedom fighters birth anniversary only in elections years\nBrazil president thanks India for sanjeevani booti vaccines tweets image of Hanuman: Jair Bolsonaro tweeted an image showing the Hindu deity ferrying the shots to the country.\nTV and radio personality","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-23T15:34:00","provider":{"name":"scroll","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://s01.sgp1.cdn.digitaloceanspaces.com/book/153793-glskcbuspl-1611415212.jpg","height":315,"width":600,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=3381894240949218832","thumbnailHeight":117,"thumbnailWidth":222,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"scroll","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://scroll.in/latest/984926/the-big-news-farmers-say-police-have-approved-republic-day-tractor-rally-and-9-other-top-stories"}},{"id":"4872194043672243454","title":"SA regulator backs distribution of AstraZeneca shots","url":"https://www.moneyweb.co.za/news/south-africa/sa-regulator-backs-distribution-of-astrazeneca-shots/","description":"Health department recognised as a supplier of The Serum Institute of India.","body":"You will be redirected to a checkout page.\nTo view all features and options, click here\nA monthly subscription is charged pro rata, based on the day of purchase. This is non-refundable and includes a R5 once-off sign-up fee.\nA yearly subscription is refundable within 14 days of purchase and includes a 365-day membership.\nClick here\nfor more information.\nSouth Africa recently struck a deal with The Serum Institute to receive the countrys first coronavirus vaccines this month and next, as part of the earliest phase of a plan the government says will inoculate two-thirds of the population by the end of 2021.\nAn initial 1.5 million doses will come from the institute, which is producing the version developed by AstraZeneca and Oxford, Mkhize said in a statement earlier this month. They will be reserved for health workers, and negotiations are ongoing with other manufacturers about further supplies, he said.\nWe will, in the next coming days, engage with the public in order to give an update on the progress of the first batch of the vaccines that we committed would be received in the first quarter, the health ministry said in Fridays statement. At this stage we would like to assure South Africans that all is on track. We are working closely with all relevant stakeholders to ensure a smooth implementation of the vaccine roll-out program.\n 2021 Bloomberg L.P.","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-23T15:30:40","provider":{"name":"moneyweb","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://www.moneyweb.co.za/wp-content/uploads/2021/01/367434927-1024x692.jpg","height":692,"width":1024,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=5650462756773030215","thumbnailHeight":346,"thumbnailWidth":512,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"moneyweb","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://www.moneyweb.co.za/news/south-africa/sa-regulator-backs-distribution-of-astrazeneca-shots/"}},{"id":"6206168145824673668","title":"The White Tiger review","url":"https://afro.com/the-white-tiger-review/","description":"By Dwight Brown, NNPA News Wire film critic Is this just another passive servant movie, like Gone With the Wind, The Help, or Roma? Or does it have a new kick? In 2008, Indian/Australian author Aravind Adiga wrote his debut novel The White Tiger, and its thoughtful examination of the Indias caste system was rewarded []","body":"Close\nPrivacy Overview\nThis privacy policy has been compiled to better serve those who are concerned with how their Personally identifiable information (PII) is being used online. PII, as used in US privacy law and information security, is information that can be used on its own or with other information to identify, contact, or locate a single person, or to identify an individual in context. Please read our privacy policy carefully to get a clear understanding of how we collect, use, protect or otherwise handle your Personally Identifiable Information in accordance with our website.\nWhat personal information do we collect from the people that visit our blog, website or app?\nWhen ordering or registering on our site, as appropriate, you may be asked to enter your Name, Email address, Mailing address, Phone number, Credit card information or other details to help you with your experience.\nWhen do we collect information?\nWe collect information from you when you register on our site, place an order, subscribe to a newsletter, respond to a survey, fill out a form or enter information on our site.\nHow do we use your information?\nWe may use the information we collect from you when you register, make a purchase, sign up for our newsletter, respond to a survey or marketing communication, surf the website, or use certain other site features in the following ways:\n To personalize users experience and to allow us to deliver the type of content and product offerings in which you are most interested.\n To improve our website in order to better serve you.\n To allow us to better service you in responding to your customer service requests.\n To administer a contest, promotion, survey or other site feature.\n To quic","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-23T15:28:52","provider":{"name":"afro","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://afro.com/wp-content/uploads/2021/01/1A-Rajkummar-Rao-Priyanka-Chopra-Jonas-Adarsh-Gourav-in-The-White-Tiger.jpg","height":427,"width":640,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=1002892714899047225","thumbnailHeight":106,"thumbnailWidth":158,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"afro","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://afro.com/the-white-tiger-review/"}},{"id":"905554804100422762","title":"Chennai Air customs arrests 9; seizes 8.45 kg gold worth Rs 4.30 crores","url":"https://zeenews.india.com/india/chennai-air-customs-arrests-9-seizes-8-45-kg-gold-worth-rs-4-30-crores-2337478.html","description":"Seventeen passengers including four ladies who had arrived fromDubaiby Fly Dubai flightFZ8515 andEmirates flight EK 542were interceptedat the exiton suspicion of carrying of gold.Ontheirpersonalsearch, 48 bundles of gold paste weighing9.03kgwererecovered from the rectum. On extraction7.72kgsof gold worth Rs.3.93croreswererecovered.","body":"Jan 23, 2021, 19:24 PM IST\nHighlights\n48 bundles of gold paste weighing 9.03 kg were recovered from the rectum.\nOn extraction 7.72 kgs of gold worth Rs. 3.93 crores were recovered.\nTotal 8.45 kg gold worth Rs.4.30 crores seized by Chennai Air Customs in 18 cases.\nChennai: Based on the information, seventeen passengers including four ladies who had arrived from\nDubai\nby Fly Dubai flight FZ8515 and Emirates flight EK 542 were intercepted at the exit on suspicion of carrying of gold on Friday (January 23). On their personal search, 48 bundles of gold paste weighing 9.03 kg were recovered from the rectum. On extraction 7.72 kgs of gold worth Rs. 3.93 crores were recovered.\nOn further search, 12 gold cut bits weighing 386 grams and 1 gold chain weighing 74 grams were also recovered from their pant pockets and handbags. Total 8.18 kgs of gold worth Rs. 4.16 crore was recovered and seized under the Customs Act. Nine arrested including one lady.\nIn another case, one Kalandar Ilyas, 28, of Ramanathapuram who arrived from Sharjah by Indigo flight 6E 8245 was intercepted at the exit. On personal search, three bundles of gold paste weighing 310 grams were recovered from the rectum. On extraction 271 grams of gold worth Rs. 14 lakhs was recovered and seized under the Customs Act.\nTotal 8.45 kg gold worth Rs.4.30 crores seized by ChennaiAir Customs in 18 cases. Nine arrested including one lady.\nFurther investigation is under progress.\nRead latest news of India and world, bollywood news, business updates, cricket scores, etc.   Download the Zee news appnow to keep up with daily breaking news and   live news event coverage\nTags:","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-23T13:37:53","provider":{"name":"india","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://english.cdn.zeenews.com/sites/default/files/2021/01/23/912385-e6-4.jpg","height":540,"width":970,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=8421952040446087627","thumbnailHeight":270,"thumbnailWidth":485,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"india","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://zeenews.india.com/india/chennai-air-customs-arrests-9-seizes-8-45-kg-gold-worth-rs-4-30-crores-2337478.html"}},{"id":"571804421139959439","title":"[Live] Watch UFC 257: Poirier vs. McGregor 2 Stream Online Reddit free Official Channels HD -","url":"https://www.kusi.com/live-watch-ufc-257-poirier-vs-mcgregor-2-stream-online-reddit-free-official-channels-hd/","description":"With Poirier vs. McGregor 2, we have two of the most exciting athletes will finally have their rematch as No. 2-ranked lightweight and former interim championDustin Poirierfaces former featherweight and lightweight champion Conor McGregor atUFC257. Ultimate Fighting Championship (UFC) has spent the past nine months struggling to lay enough track in front of the train to keep the promotion going...","body":"5:56 PM\nSponsered Content\nWith Poirier vs. McGregor 2, we have two of the most exciting athletes will finally have their rematch as No. 2-ranked lightweight and former interim championDustin Poirierfaces former featherweight and lightweight champion Conor McGregor atUFC257.\nUltimate Fighting Championship (UFC) has spent the past nine months struggling to lay enough track in front of the train to keep the promotion going amidst the craziness of a COVID-centric 2020.\nSo its not that much of a surprise that the promotion hasnt focused too much on the return of Conor McGregor at UFC 257 on Jan. 23, 2021.\nUfc 257 Fight\nThe co-main event will round out a stellar showing of the lightweight division as No. 6 contenderDan Hookerlooks to spoil the highly anticipated debut ofMichael Chandler at the Fight Island in Abu Dhabi, United Arab Emirates, on Sunday.\nUFC 257 Live Stream Reddit Channels\nIts almost time forUFC 257 Live Stream Redditand if you just cant wait to catch the epic-looking MMA event, ESPN+ has officially opened PPV sales so you can get prepared well in advance.\n\nWhoever youre cheering on during this weekends MMA action, well show you how to live stream UFC 257s main card from anywhere in the world.\nWhat time does UFC 257 start?\nThe preliminary card starts at 5:00 AM IST (JAN 24); 6.15 PM ET / 3.15 PM PT / 11.30 PM GMT (Saturday, January 23) | 5 AM IST (Sunday, January 24). The main card, meanwhile, starts at 8.30 AM IST (JAN 24) 10 PM ET / 7 PM PT (Saturday, January 23) | 3 AM GMT /\nWhen and where is UFC 257 taking place?\nThe event is set to take place on Sunday (January 24) at the Etihad Arena on Yas Island, Abu ","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-24T01:18:42","provider":{"name":"kusi","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://i2.wp.com/worldinsport.com/wp-content/uploads/2021/01/Poirier-vs.-McGregor-2.jpg","height":800,"width":1200,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=3825674365772900433","thumbnailHeight":200,"thumbnailWidth":300,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"kusi","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://www.kusi.com/live-watch-ufc-257-poirier-vs-mcgregor-2-stream-online-reddit-free-official-channels-hd/"}},{"id":"5314411157079081079","title":"The day I escaped blast in J&K : The Tribune India","url":"http://tribuneindia.com/news/comment/the-day-i-escaped-blast-in-jk-202681","description":"In troubled areas like Jammu and Kashmir, violence and its brutal aftermath are a constant part of daily life, and it requires both professionalism and providence to survive and succeed. Two instances demonstrate that  in ample measure Today, I thought I would recall some of the events occurring in Jammu and Kashmir in the late 1990s where I was then posted as DGP. I would normally visit the place wherever a serious terrorist incident had taken place. I would usually travel by the state helicopter and then drive to the scene of cr","body":"Photo for representation only. - File photo\nGurbachan Jagat\nThe writer is ex-chairman of UPSC, former Manipur Governor and served as J&K DGP\nToday, I thought I would recall some of the events occurring in Jammu and Kashmir in the late 1990s where I was then posted as DGP. I would normally visit the place wherever a serious terrorist incident had taken place. I would usually travel by the state helicopter and then drive to the scene of crime as the geographic distances in J&K are huge and a large territory had to be covered in a short time. Going by helicopter reduced the level of force deployment along the route and also decreased the risk element. A serious crime had taken place in a village near Rajouri and I took the helicopter to visit the village. My staff officer was with me and the village was a short distance from the helipad. We reached the village and interacted with the villagers, along with the police station staff, who had reached earlier. While flying to Rajouri, I had told my staff officer to fix a meeting of the local officers at the Police Lines after the visit to the village.\nThe idea was to discuss the local law and order situation. The helipad was very close to the Police Lines but as we were approaching the site on our return, I abruptly told the SO that I wanted to skip the meeting and go to the helipad directly. The SO correctly pointed out that the officers had already arrived and it would take a few minutes only to attend the meeting. I was, however, adamant a","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-24T06:14:30","provider":{"name":"tribuneindia","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://englishtribuneimages.blob.core.windows.net/gallary-content/2021/1/Desk/2021_1$largeimg_352918081.JPG","height":440,"width":660,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=2782693679046175913","thumbnailHeight":164,"thumbnailWidth":247,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"tribuneindia","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"http://tribuneindia.com/news/comment/the-day-i-escaped-blast-in-jk-202681"}},{"id":"1698373543904167184","title":"Exclusive  Bigg Boss 14: The house has become a chaotic hotel, its boring, former contestants speak out","url":"http://timesofindia.indiatimes.com/tv/news/hindi/exclusive-bigg-boss-14-the-house-has-become-a-chaotic-hotel-its-boring-former-contestants-speak-out/articleshow/80431174.cms","description":"Whether it's due to the drop in ratings that the show has seen in its 14th season or that it has run its course and gone out of steam, we do not know-","body":"Created: Jan 24, 2021, 10:50 IST\nfacebook\ntwitter\nPintrest\nWhether it's due to the drop in ratings that the show has seen in its 14th season or that it has run its course and gone out of steam, we do not know- but the fact is that we are currently seeing a different Bigg Bossshow which most viewers are not enjoying. A show which was an addiction has now disinterest, disappointment and disconnect written all over it. The biggest culprit is not the entry of former contestants from Day 1 (\nHina Khan\n, Sidharth Shukla, Gauahar Khan) which was earlier a matter of debate, but the random exits and re-entries which have become the order of almost every week.\nThe first one to return after an ugly spat with Eijaz Khan was Kavita Kaushik. After a dramatic entry followed by a tearful drama with his alleged girlfriend Jasmin Bhasin, Aly Goni walked out to only rush back into Jasmin's arms a few days later. Nikki Tamboliwas shown the door, but the producers and broadcaster want us to believe that public demand brought her back.\nRahul Vaidya was fed up being cut away from home and pleaded to go home, but was soon rooting for his own return which met with a nod of consent from those who matter. Vikas Gupta returned despite a nasty fight with Arshi Khan but is now mysteriously missing; some say he is coming back and some say he is so disgusted with all that happened to him inside the House that he is not attending anybody's calls. Manu Punjabi entered and exited without anybody clamouring for him. And now we hear, Devoleena Bhattacharjee who entered will make way for Eijaz Khan to make a comeback.\nETimes TV spoke to a host of former participants to know their take on the Bigg Boss show's new avatar.\nMahek Chahal (Runner-Up, Season 5) says that she feels that the reason to bring back the former players is only because the current lot does not know how to play the game interestingl","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-24T05:20:00","provider":{"name":"indiatimes","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://static.toiimg.com/thumb/msid-80431156,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-736050/80431156.jpg","height":580,"width":1069,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=2699334671971483082","thumbnailHeight":217,"thumbnailWidth":399,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"indiatimes","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"http://timesofindia.indiatimes.com/tv/news/hindi/exclusive-bigg-boss-14-the-house-has-become-a-chaotic-hotel-its-boring-former-contestants-speak-out/articleshow/80431174.cms"}},{"id":"5193803893088175808","title":"The USAs moment of reckoning speaks to all of us","url":"https://indianexpress.com/article/express-sunday-eye/the-usas-moment-of-reckoning-speaks-to-all-of-us-7158977/","description":"What India - and the rest of the world - can learn from how the world's oldest democracy tackled its most urgent crisis","body":"January 24, 2021 6:15:50 am\nIllustration : Suvir Saran\nScience tells us about the dopamine rush we experience when we process information that supports our beliefs, no matter how fake that information might be. Most of us tire easily and choose to remain in the comforting confines of sameness, where our misguided thoughts go unchecked and we feel good about ourselves and the world as we choose to see it.\nBut reason demands more from us. Reason challenges us to evolve and grow.\nModern School, Vasant Vihar in New Delhi, was originally conceived as an alternative to the missionary schools operating through the prism of Christianity and the colonisers sensibilities about education and childhood development. My father was educated at Modern while my mother is a product of Irish Catholic convent education. I consider it my good luck to have benefited from a mix of their two educational sensibilities. From age six to 18, I was made aware of Indias challenges, its cultural wealth and societal issues, its rich diversity and fragile secular dreams. My parents came of age with a colonial background from which they gleaned light and growth. I came of age in an India gluing itself into a mosaic, where plurality was valued and our many Indian faces and forms connected us to our common humanity. The challenge of this immense task, the communal riots and vexing polarisations fomented by recklessly self-serving and vote-hungry politicians, was ours to observe, study and discuss with our teachers and parents. I grew up watching India go from strength to strength while occasionally being brought to its knees through human folly.\nhttps://images.indianexpress.com/2020/08/1x1.png\nThe autumn of 1993 brought me to New York City to study graphic design and art history. Family and friends welcomed me with love and gave me nurturing support. I found myself happily settled in NYC within weeks and living the life of a Man","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-24T00:45:50","provider":{"name":"indianexpress","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://images.indianexpress.com/2021/01/P2-Suvir-1200.jpg","height":670,"width":1200,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=1271994352691759394","thumbnailHeight":167,"thumbnailWidth":299,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"indianexpress","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://indianexpress.com/article/express-sunday-eye/the-usas-moment-of-reckoning-speaks-to-all-of-us-7158977/"}},{"id":"7779709794306016396","title":"Netaji was a devout Hindu, but he respected all religions: Daughter","url":"https://truthdive.com/2021/01/24/netaji-was-a-devout-hindu-but-he-respected-all-religions-daughter-india-news/","description":"CALCUTTA: Germany-based Netaji Subhas Chandra Boses daughter Anita B Pfaff chose her 125th birth anniversary on Saturday to paint the person behind the legend as a devout Hindu, though tolerant of all others. religions . He inspired his followers, members of the Indian National Army, his friends and his family, to respect other religions and...","body":"Netaji was a devout Hindu, but he respected all religions: Daughter |  India News\nRumita Patel\n|\nJan 24, 2021\nCALCUTTA: Germany-based Netaji Subhas Chandra Boses daughter Anita B Pfaff chose her 125th birth anniversary on Saturday to paint the person behind the legend as a devout Hindu, though tolerant of all others. religions .\nHe inspired his followers, members of the Indian National Army, his friends and his family, to respect other religions and yet be very religious himself, Pfaff said in a video message posted on the official Twitter account. of the Consulate General of India in Munich.\nUnderlining the ideals of unity and tolerance that his father espoused throughout his life, Pfaff described him as a man of thought and also of action.  He envisioned an India that would be modern, enlightened, and at the same time deeply rooted in history, philosophy and religious traditions, he said.\nI hope we can all be inspired by Netajis ideas and ideals. I congratulate you on these efforts. Jai Hind.\nIn Kolkata, the chairman of the Netaji Research Office and former Trinamool MP Sugata Bose, who is one of Subhas Chandra Boses great-nephews, said it was more important to follow Netaji and Gandhijis ideals of uniting all castes. and communities that give a particular label to the anniversary of their birth.\nThe important thing is not how we change the name of his birth anniversary  Personally, I do not like the term Parakram Diwas very much. I much prefer Deshanayak Diwas, said Sugata Bose after saying goodbye to Prime Minister Narendra Modi after his visit. to Elgin from Netaji.  Road residence.","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-24T04:18:44","provider":{"name":"truthdive","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://truthdive.com/wp-content/uploads/2021/01/Netaji-was-a-devout-Hindu-but-he-respected-all-religions.jpg","height":580,"width":1069,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=4452969821920786112","thumbnailHeight":144,"thumbnailWidth":267,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"truthdive","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://truthdive.com/2021/01/24/netaji-was-a-devout-hindu-but-he-respected-all-religions-daughter-india-news/"}},{"id":"641693559874673460","title":"eGrocery to grow 8X in 5 years in India, JioMart big gainer","url":"https://telanganatoday.com/egrocery-to-grow-8x-in-5-years-in-india-jiomart-big-gainer","description":"As companies from Reliance to BigBasket put their top dollar in serving daily grocery at your doorsteps, online grocery is going to be the next battleground for growth, expanding to over $18 billion by 2024.","body":"24th Jan 2021\n10:05 am\nNew Delhi: As the e-commerce battle intensifies in India, with Reliance Retails JioMart being the latest major entrant with a massive potential to disrupt the space, the next big thing is the delivery of groceries online and the market size is estimated to grow eight times in the next five years in the country.\nAs companies from Reliance to BigBasket put their top dollar in serving daily grocery at your doorsteps, online grocery is going to be the next battleground for growth, expanding to over $18 billion by 2024.\nThe eGrocery market has grown 60 per cent from the calendar year 2020 and is expected to grow 41-49 per cent by the first half of CY21, according to the latest data provided by homegrown consulting firm RedSeer.\nAnother recent report by Bengaluru-based RedSeer and Bigbasket (Brand Intelligence) found that demand for comfort foods like noodles and cookies, immunity boosters such as lemon, and hygiene products like sanitisers picked up after the pandemic while essentials remained strong.\nWithin snacks and branded foods, biscuits and cookies were the largest sub-category and grew the most.\nWe have observed that traditional brands which pivoted quickly to be digitally ready brands have seen 2x+ jump in sales compared to offline brands, said Anil Kumar, founder and CEO of RedSeer.\nNow, JioMart is set to take the pole position in online delivery of groceries.\nGrocery is the largest retail category. This makes it an important category for retailers and one that is going to drive future growth of online retail sales. JioMart will definitely be a key player in the months to come, said Satish Meena, Senior Forecast Analyst with global market research firm Forrester.\nDriven by the uptick in online grocery adoption due to the Covid-19 pandemic, online retail sales will grow at a CAGR o","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-24T03:58:50","provider":{"name":"telanganatoday","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://cdn.telanganatoday.com/wp-content/uploads/2021/01/eGrocery-to-grow-8X-in-5-years-in-India-JioMart-big-gainer.jpg","height":370,"width":680,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=4786899779577644382","thumbnailHeight":277,"thumbnailWidth":509,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"telanganatoday","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://telanganatoday.com/egrocery-to-grow-8x-in-5-years-in-india-jiomart-big-gainer"}},{"id":"4765842808939308555","title":"Air Force Chief Marshal RKS Bhadauria warns China against aggression, makes this BIG statement","url":"http://dnaindia.com/india/report-air-force-chief-marshal-rks-bhadauria-warns-china-against-aggression-makes-this-big-statement-2870335","description":"Air Force Chief Marshal RKS Bhadauria warns China against aggression, makes this BIG statement - IAF Air Chief Marshal RKS Bhadauria on Saturday issued a stern warning to Beijing asserting that India can also urn aggressive if China will do so.","body":"Ministry of External Affairs (MEA) had responded to media reports that China\nhas made constructions in Arunachal Pradesh, saying that the government is closely monitoring the developments which can impact India's security.\n\"We have seen recent reports on China undertaking construction work along the border areas with India. China has undertaken such infrastructure construction activity in the past several years,\" the statement said.\n\"In response, our government too has stepped up border infrastructure including the construction of roads, bridges etc, which has provided much needed connectivity to the local population along the border,\" it added.\nThe Chinese Foreign Ministry, however, claimed that Beijing is undertaking development and construction activities \"within its own territory\" is \"normal\".\n\"China's position on the Zangnan region (South Tibet) is consistent and clear. We never recognised the so-called Arunachal Pradesh,\" Chinese Foreign Ministry spokesperson Hua Chunying told a media briefing while responding to a question.\nMeanwhile, the 9th round of India-China Corps Commander-level military talks to defuse tension along the LAC in Eastern Ladakh will take place on Sunday (January 24). The talks are expected to begin at around 9.30-10 am on January 24 in Moldo, opposite the Chushul sector in India.\nThe military talks come after more than two months. The last talks (8th round) took place on November 6, 2020, in Chushul in Eastern Ladakh.\nThe talks come even as the many months' long India-China standoff at the Line of Actual Control (LAC) in Eastern Ladakh continues. The standoff that started in April/May last year saw Galwan incident in June during which 20 Indian soldiers died due to aggressive actions by the Chinese army. China has stayed mum about the casualti","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-24T04:44:00","provider":{"name":"dnaindia","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://cdn.dnaindia.com/sites/default/files/styles/full/public/2021/01/24/952289-949975-iaf-chief-rks-bhadauria.jpg","height":720,"width":1280,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=8828259514164634268","thumbnailHeight":180,"thumbnailWidth":320,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"dnaindia","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"http://dnaindia.com/india/report-air-force-chief-marshal-rks-bhadauria-warns-china-against-aggression-makes-this-big-statement-2870335"}},{"id":"2035294235006198993","title":"Latest News: India-China To Hold 9th Round of Military Talks Today","url":"https://www.thequint.com/news/breaking-news/latest-news-breaking-news-live-updates-24-january","description":"Latest News: India-China To Hold 9th Round of Military Talks Today","body":"Catch the latest news updates of the day here.\n9:12 AM ,     24     Jan\nIndia-China to Hold 9th Round of Military Talks in Ladakh\nThe ninth round of Corps Commander-level talks between India and China is set to take place today in Moldo, opposite Chushul sector in Eastern Ladakh, reported news agency ANI quoting army sources.\n(The Quint is available on Telegram. For handpicked stories every day, subscribe to us on","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-24T03:42:47","provider":{"name":"thequint","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://images.thequint.com/thequint%2F2019-09%2F09ee0335-f770-4dc9-8110-d08f457f3091%2FTop_News.jpg?rect=0%2C0%2C735%2C386&amp;w=1200&amp;auto=format%2Ccompress&amp;ogImage=true","height":386,"width":735,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=6917865283042599269","thumbnailHeight":192,"thumbnailWidth":367,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"thequint","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://www.thequint.com/news/breaking-news/latest-news-breaking-news-live-updates-24-january"}},{"id":"7878911884158855618","title":"India vs Australia: Tim Paine played perfect host by missing Rishabh Pant stumping chance, jokes R Ashwin","url":"http://indiatoday.intoday.in/sports/cricket/story/sarcastic-r-ashwin-takes-another-jibe-at-tim-paine-india-vs-australia-border-gavaskar-test-series-1762152-2021-01-24","description":"Tim Paine was left red-faced after sledging Ravichandran Ashwin in Sydney as India stunned Australia in the Brisbane Test to clinch the Border-Gavaskar series 2-1.","body":"January 24, 2021\nUPDATED: January 24, 2021 09:32 IST\nNot just R Ashwin but even his wife Prithi trolled Tim Paine on social media after India breached fortress Gabba (AP Photo)\nHIGHLIGHTS\nTim Paine has been facing backlash ever since he sledged R Ashwin in the Sydney Test\nPaine's captaincy has come under the scanner after Australia's Test series loss against India\nPaine is the only Australian captain to lose a Test series against India twice on home soil\nTeam India off-spinner Ravichandran Ashwin took another cheeky dig at Australia captain Tim Paine after their infamous sledging incident which left the latter red-faced as his team lost the Test series earlier this week.\nPaine and Ashwin were involved in an ugly war of words on the final day of the third Test in Sydney when the Indian cricketer was trying to save the match along with Hanuma Vihari.\nCant wait for you to come to Gabba, is what Paine told Ashwin before the latter hit back with, \"Just like we want to get you to India that will be your last series.\"\nThe video of the incident went viral on social media as Ashwin and Vihari, both batting with injuries, blocked out more than 42 overs to salvage a draw for Team India despite.\nFans and cricket pundits launched into Paine for his abusive rant against Ashwin. The Aussie skipper even had to issue a public apology after the game.\nThere was further misery in store for Paine as Australia suffered a humiliating defeat against a depleted Indian team at the Gabba, where the hosts hadn't lost a Test in 32 years.\nNot only did they lose the Test match in Brisbane, Paine's Australia also conceded the series 2-1 to India for the second time in a row on home soil.\nTim Paine missed the stumping of Pant in the second innings of the Gabba Test. But I started liking him, he invited us, played the perfect hosts by missing the stumping chance, and awarded us the s","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-24T04:02:14","provider":{"name":"intoday","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202101/AP21011262755318_2-647x363.jpeg?M6dDJd6rmB4ZI.eiXefLc_glL88UdmlC","height":363,"width":647,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=1421445336667111715","thumbnailHeight":181,"thumbnailWidth":322,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"intoday","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"http://indiatoday.intoday.in/sports/cricket/story/sarcastic-r-ashwin-takes-another-jibe-at-tim-paine-india-vs-australia-border-gavaskar-test-series-1762152-2021-01-24"}},{"id":"4051894207383670929","title":"All 10 new Covid-19 cases in Singapore imported, Singapore News & Top Stories","url":"http://www.straitstimes.com/singapore/all-10-new-covid-19-cases-in-singapore-imported","description":"All 10 new Covid-19 cases reported yesterday were imported, and had been placed on stay-home notice upon their arrival in Singapore, said the Ministry of Health (MOH). All of them were asymptomatic and were detected from proactive screening and surveillance, added MOH in its daily update yesterday.. Read more at straitstimes.com.","body":"Frequently asked questions\nAll 10 new Covid-19 cases reported yesterday were imported, and had been placed on stay-home notice upon their arrival in Singapore, said the Ministry of Health (MOH). All of them were asymptomatic and were detected from proactive screening and surveillance, added MOH in its daily update yesterday.\nThe new cases took Singapore's total to 59,260. There were no new cases in the community or in workers' dormitories.\nThe new cases comprise two Singaporeans, one work pass holder, five work permit holders, and two short-term visit pass holders.\nThe Singaporeans are a 36-year-old woman and an eight-year-old boy who returned from India. They have four previous cases as common contacts, including each other. The work pass holder, a 42-year-old man, also came from India. The work permit holders are all foreign domestic workers who arrived from Indonesia and Myanmar.\nOne of the short-term visit pass holders came from the United States to visit his Singaporean fiancee, and the other came from Ecuador for a work project here.\nThe number of new cases in the community has risen to 17 in the past week, from six cases the week before. The number of unlinked cases in the community has dropped to three from four cases over the same time period.\nTwo new places were added to the list of public places visited by cases in the community during the period when they were infectious - ESR BizPark @ Chai Chee at 750 Chai Chee Road, on Jan 17, and Upper Boon Keng Market and Food Centre, on Jan 15.\nOf the 177 cases reported from last Sunday to yesterday, 89 tested positive for their serology tests, 30 tested negative, and 58 results are pending.\nWith 32 cases discharged yesterday, 59,000 ","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-23T21:00:00","provider":{"name":"straitstimes","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://www.straitstimes.com/sites/all/themes/custom/bootdemo/images/facebook_default_pic_new.jpg","height":800,"width":1200,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=8804261786333902521","thumbnailHeight":74,"thumbnailWidth":112,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"straitstimes","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"http://www.straitstimes.com/singapore/all-10-new-covid-19-cases-in-singapore-imported"}},{"id":"7576263803669437380","title":"Amit Shah launches Ayushman Bharat health scheme for Central Armed Police Forces","url":"https://www.firstpost.com/india/amit-shah-launches-ayushman-bharat-health-scheme-for-central-armed-police-forces-9234311.html","description":"The home minister ceremoniously distributed the 'Ayushman CAPF' health cards among some personnel from the seven Central Armed Police Forces (CAPF) in Guwahati on Saturday","body":"Most Read\nMajor 7.0 magnitude earthquake strikes near Chilean Antarctica base; officials issue tsunami warning\nThe quake struck about 210 kilometres east of the base at a depth of 10 kilometres, Chile's National Emergency Office (Onemi) said, urging evacuation from 'the beach area of the Antarctic' ahead of a possible tsunami\nAhead of Union Budget, traditional halwa ceremony held at finance ministry; Nirmala Sitharaman launches mobile app\nFor the first time in India, the Union Budget 2021 will be paperless in the view of the coronavirus outbreak\nAmit Shah launches Ayushman Bharat health scheme for Central Armed Police Forces\nThe home minister ceremoniously distributed the 'Ayushman CAPF' health cards among some personnel from the seven Central Armed Police Forces (CAPF) in Guwahati on Saturday\nAAP MLA Somnath Bharti gets two years in jail for assaulting security staff at AIIMS; party calls it 'injustice'\nBharti, however, was granted bail to enable him to file an appeal before the high court against his conviction in the case and jail term\nMamata Banerjee demands four capitals for India, says Parliament sessions should alternate between locations\nCriticising the Centre for abolishing the Planning Commission, the West Bengal chief minister also said that the Niti Aayog and the planning panel can co-exist\nPartnered: 3 in 4 Indians are splurging on technology this festive season. You too can be one of them with HDFC Bank Festive Treats!\n.\nRelated Articles\nRelated Articles","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-24T03:39:50","provider":{"name":"firstpost","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://images.firstpost.com/wp-content/uploads/2020/06/amit-shah_640.jpg","height":342,"width":640,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=7503207943084148017","thumbnailHeight":171,"thumbnailWidth":320,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"firstpost","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://www.firstpost.com/india/amit-shah-launches-ayushman-bharat-health-scheme-for-central-armed-police-forces-9234311.html"}},{"id":"5970017178948780370","title":"IFFI Spotlight 2021: Celebrating the life of Netaji Subhas Chandra Bose on day 8 of the fest","url":"https://www.freepressjournal.in/entertainment/iffi-spotlight-2021-celebrating-the-life-of-netaji-subhas-chandra-bose-on-day-8-of-the-fest","description":"On Day 8 of the 51st edition of the International Film Festival of India (IFFI) at Goa, celebrations began to commemorate Netaji Subhas Chandra Boses 125th birth anniversary.","body":"Sunday, January 24, 2021, 7:00 AM\nIST\nIFFI Spotlight 2021: Celebrating the life of Netaji Subhas Chandra Bose on day 8 of the fest\nBy\nThe festival organised a special screening at the festival venue of Shyam Benegals 2005 film Netaji Subhas Chandra Bose: The Forgotten Hero\nNetaji Subhas Chandra Bose: The Forgotten Hero\nOn Day 8 of the 51st edition of the International Film Festival of India (IFFI) at Goa, celebrations began to commemorate Netaji Subhas Chandra Boses 125th birth anniversary.\nThe festival organised a special screening at the festival venue of Shyam Benegals 2005 film Netaji Subhas Chandra Bose: The Forgotten Hero. With this, the film festival joined the nation and the world in celebrating the life and selfless service of Indias indomitable freedom fighter. Festival Director Chaitanya Prasad noted, Netaji remains one of the most beloved national heroes and a towering icon of Indias freedom struggle. On the 125th birth anniversary of the great freedom fighter, we fondly remember Netajis unparalleled contribution to the country.\nFilms on life and afterlife\nMarathi film Karkhanisanchi Waari (Ashes on a Road Trip) by director Mangesh Joshi was screened in the Indian Panorama segment. Producer Archana Borhade and actors Geetanjali Kulkarni and Pradeep Joshi attended the screening. The film features a Karkhanis family based in Pune and depicts what follows when the eldest patriarch passes away and the siblings and son undertake an eventful journey to disperse his ashes as per his final wish.\nAnother film that was screened in this segment was Prawaas. During a press conference, Prawaas director Shashank Udapurkar, while speaking about his film said, Prawaas is a story of someone who realises his why and finds out his time on earth is limited.\nThe crew of Prawaas\nPrawaas is the journey of an elderly couple, played by Ashok Saraf and ","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-24T01:30:00","provider":{"name":"freepressjournal","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://gumlet.assettype.com/freepressjournal%2F2021-01%2F6fdf4a83-d47a-40f7-a137-1a7b36c14077%2Fsubhas.jpg?rect=0%2C0%2C760%2C399&amp;w=1200&amp;auto=format%2Ccompress&amp;ogImage=true","height":399,"width":760,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=5369839404264375491","thumbnailHeight":111,"thumbnailWidth":211,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"freepressjournal","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://www.freepressjournal.in/entertainment/iffi-spotlight-2021-celebrating-the-life-of-netaji-subhas-chandra-bose-on-day-8-of-the-fest"}},{"id":"7257552172487810043","title":"Indias reckless actions endangering peace in South Asia: Pakistan","url":"https://nation.com.pk/24-Jan-2021/india-s-reckless-actions-endangering-peace-in-south-asia-pakistan","description":"GENEVA - Pakistan has warned the international community that India, emboldened by supply of advanced weapons and technologies, was operationalising offensive doctrines","body":"Agencies\nJanuary 24, 2021\nGENEVA - Pakistan has warned the international community that India, emboldened by supply of advanced weapons and technologies, was operationalising offensive doctrines into war-fighting strategies that threaten peace in South Asia and beyond.\nSpeaking in the Geneva-based Conference on Disarmament (CD), Ambassador Khalil Hashmi said India was pursuing policies of hegemony, subversion and domination over its neighbours, all driven by an extremist ideology and hyper-nationalism.\nThere is an unmistakable pattern and method adopted by the Indian ruling party -- staging false flag operations, externalising blame and manipulating national sentiment to win elections, the Pakistani envoy told the 65-member panel mandated to negotiate arms control and disarmament agreements.\nThis recklessness endangers regional peace and security in South Asia, he said.\nBroadcaster Larry King passes away at 87\nWhile pushing for a permanent seat at the United Nations Security Council, Ambassador Hashmi said India continues to defy with impunity the 15-member bodys resolutions by further entrenching its occupation of an internationally recognised disputed territory-- Jammu and Kashmir.\n\nA self-professed largest democracy in the world, it has violated every tenet of international humanitarian and human rights laws; by locking down 8 million people, shutting all means of communication and rejecting calls for independent investigations into its industrial scale abuses in occupied Jammu and Kashmir, he said.\nMasquerading as a victim of terrorism, the racial superiority-inspired BJP regime has unleashed the most brutal state-directed terrorism on Kashmiri youth, women and civilians, the Pakistani envoy said, adding it also financed, abetted, facilitated and directed state-sponsored acts of terrorism against its neighbours.\nUS dollar being sold at Rs161","keywords":"","language":"en","isSafe":false,"datePublished":"2021-01-24T04:02:35","provider":{"name":"nation","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://nation.com.pk/print_images/large/2021-01-24/india-s-reckless-actions-endangering-peace-in-south-asia-pakistan-1611460950-1351.jpg","height":600,"width":800,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=7983944202810637257","thumbnailHeight":225,"thumbnailWidth":300,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"nation","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://nation.com.pk/24-Jan-2021/india-s-reckless-actions-endangering-peace-in-south-asia-pakistan"}},{"id":"4993055145066794982","title":"India, China Hold Round 9 Of Military Talks Today Amid Border Standoff","url":"https://www.ndtv.com/india-news/india-china-to-resume-military-talks-today-after-two-months-2357226?pfrom=home-ndtv_topscroll","description":"Military commanders of India and China will meet today for a ninth time for talks to defuse tension along the Line of Actual Control in eastern Ladakh and find a solution to end the standoff. The talks will be held at Moldo, opposite Chushul sector in India.","body":"Updated: January 24, 2021 10:32 am IST\nIn the last round, the Indian Army insisted on an early disengagement by Chinese troops.\nNew Delhi:\nMilitary commanders of India and China will meet today for a ninth time for talks to defuse tension along the Line of Actual Control in eastern Ladakh and find a solution to end the standoff. The talks will be held at Moldo, opposite Chushul sector in India.\nIn the last round of talks, the Indian Army strongly insisted on an early disengagement of troops by China from all points of friction in eastern Ladakh.\nThe nearly nine-month-long military standoff has seen tension rise along the LAC. Some 50,000 Indian Army troops are currently deployed in a high state of combat readiness in mountainous locations in eastern Ladakh in sub-zero conditions, as multiple rounds of talks between the two sides have failed to resolve the standoff.\nChina has deployed an equal number of troops, officials said.\nPromoted\nJioSaavn.com\nIndia will not reduce its troop strength unless China initiates the process, Defence Minister Rajnath Singh said on Friday in an interview to Times Now Expressing confidence that a solution to the row could be found through talks, he said India is developing its border infrastructure, some of which China has objected to, at a \"very fast rate\".\nAccording to a transcript of the interview issued by the channel, when asked about the dialogue process with China on the row, Mr Singh said, \"There is no deadline when it comes to matter like the ongoing standoff. You can't fix a date.\"\nTrack Latest NewsLive on NDTV.com. Follow our special coverage of Coronaviruspandemic in India and get newsupdates from around the world.\nWatch Live News:","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-24T03:20:31","provider":{"name":"ndtv","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://c.ndtvimg.com/2020-09/qcr6vjes_ladakh-generic_625x300_10_September_20.jpg","height":400,"width":650,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=4497797912932173032","thumbnailHeight":299,"thumbnailWidth":487,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"ndtv","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://www.ndtv.com/india-news/india-china-to-resume-military-talks-today-after-two-months-2357226?pfrom=home-ndtv_topscroll"}},{"id":"3803081882052751680","title":"Civil aviation ministry bats for coronavirus vaccines for aviation staff","url":"https://www.business-standard.com/article/current-affairs/civil-aviation-ministry-bats-for-coronavirus-vaccines-for-aviation-staff-121012301067_1.html","description":"Read more about Civil aviation ministry bats for coronavirus vaccines for aviation staff on Business Standard. Currently, doctors, nurses, and all hospital staff are being administered the Covid-19 vaccines across India","body":"has also initiated steps in this regard.\n\"The\nhas written to the Ministry of Health and Family Welfare to add in the guidelines and issue directions to the concerned,\" a senior official said.\nAirline and\nairport\nstaff who are having interface with passengers & handling cargo would be given the priority.\nCurrently, doctors, nurses, and all hospital staff are being administered the Covid-19 vaccines across India. Over a million doses have already been given in the first week of vaccination.\nRailway employees including station masters, engine drivers, ticket checkers, etc too have been selected for vaccination and their list is being compiled for the exercise.\nIndustry bodies have asked the government to vaccinate aviation staff on priority basis.\n&quot;The staff members working at the Indian airports have been frontline warriors for the nation, starting from the early days of the pandemic in January 2020 when screening measures were first implemented for arriving international passengers. The staff at airports across the country continued to discharge their duties through the pandemic, even as they faced dual risks of infection and social ostracism given the panic in the broader society during the time,\" Association of Private Airport Operators secretary-general Satyan Nair wrote in a letter to the health ministry.\nAir Passengers Association of India too had called for the inclusion of cabin crew in the list of frontline workers for Covid-19 vaccination.\nDear Reader,\nBusiness Standard has always strived hard to provide up-to-date information and commentary on developments that are of interest to you and have wider political and economic implications for the country and the world.  Your encouragement and constant feedback on how to improve our offering have only made our resolve and commitment to t","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-23T16:18:00","provider":{"name":"business-standard","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://bsmedia.business-standard.com/_media/bs/img/article/2020-12/21/full/1608572730-3016.jpg","height":464,"width":620,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=6085766939571039038","thumbnailHeight":173,"thumbnailWidth":232,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"business-standard","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://www.business-standard.com/article/current-affairs/civil-aviation-ministry-bats-for-coronavirus-vaccines-for-aviation-staff-121012301067_1.html"}},{"id":"168574883938907392","title":"See you soon: England all-rounder Ben Stokes heads to India ahead of series","url":"http://hindustantimes.com/cricket/see-you-soon-england-all-rounder-ben-stokes-heads-to-india-ahead-of-series-101611458034465.html","description":"Team India are currently leading the World Test Championship standings with 71.1 PCT % (percentage of points earned) while England are in the fourth position with 65.2.","body":"/ See you soon: England all-rounder Ben Stokes heads to India ahead of series\nBen Stokes.(Twitter)\ncricket\nSee you soon: England all-rounder Ben Stokes heads to India ahead of series\nTeam India are currently leading the World Test Championship standings with 71.1 PCT % (percentage of points earned) while England are in the fourth position with 65.2.\nBy hindustantimes.com\nPUBLISHED ON JAN 24, 2021 09:00 AM IST\nAfter defeating Australia in the Test series, India will now look to focus on the new challenge at hand. England cricket team is heading to India for a full-fledged series which will see them play four Tests, beginning on February 5, followed by five T20 Internationals and three ODIs. Crucial points are on the line in the series as both teams look to qualify for the World Test Championship final.\nTeam India are currently leading the standings with 71.1 PCT % (percentage of points earned) while England are in the fourth position with 65.2.\nOne man who would be crucial to England's chances of getting into the reckoning for the top two is going to be Ben Stokes. The all-rounder has been crucial to England's fortunes in recent years after winning the World Cup for his team while performing exceedingly well in the Ashes.\nStokes recently posted a photo of himself travelling on a plan, heading to India for the Test series.\nSee you soon India ","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-24T03:30:54","provider":{"name":"hindustantimes","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://images.hindustantimes.com/img/2021/01/24/550x309/stokes_1611458872604_1611458882797.PNG","height":309,"width":549,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=3880451079152201854","thumbnailHeight":309,"thumbnailWidth":549,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"hindustantimes","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"http://hindustantimes.com/cricket/see-you-soon-england-all-rounder-ben-stokes-heads-to-india-ahead-of-series-101611458034465.html"}},{"id":"4529144753092467811","title":"Overcoming vaccine hesitancy  the key to a successful Covid-19 inoculation drive","url":"http://economictimes.com/industry/healthcare/biotech/healthcare/overcoming-vaccine-hesitancy-the-key-to-a-successful-covid-19-inoculation-drive/articleshow/80425307.cms","description":"A week into its Covid-19 vaccination drive, India needs to overcome its vaccine hesitancy that is hobbling efforts.","body":"Comment\nSynopsis\nA week into its Covid-19 vaccination drive, India needs to overcome its vaccine hesitancy that is hobbling efforts.\nAgencies\nThe bigger challenge to tackle hesitancy, though, might well be when the vaccine drive is opened to those beyond frontline workers.\nRelated\nVaccine hesitancy will slowly go away, says virologist Dr Shahid Jameel\nPlease do come. There is no queue, it wont take long, Akash Kumar Jha says persuasively, as he speaks on the phone to a doctor at New Delhis Ram Manohar Lohia Hospital. Its one of the many calls the hospitals first officer for vaccination is making on Thursday morning to coax colleagues into coming in and rolling up their sleeves for a shot of Covaxin, one of the two vaccines Indiahas approved to immunise the country against Covid-19 Jha has good reason to be as convincing as possible  it had been five days since India launched its vaccine drivebut the numbers at RML Hospital were not encouraging. While 31 healthcare workers the only category eligible for vaccination now  took the shot on Day 1 and 69 on Day 2, the number shrank to 27 on Day 3, as against the daily target of 100.\nJha himself took the vaccine on January 16, the day the rollout began, along with his mother, a guard in the hospital. But many others have demurred, including his uncle, a lab technician in RML. The reasons for the low turnout are varied, from genuine health issues to lack of trust in Bharat Biotechs Covaxin, whose Phase III trials are still under way, to anxiety about adverse reactions. Glitches in the CoWIN app, the tech platform supporting the vaccination rollout, have also hampered efforts. The net result is a lacklustre response  by Thursday evening, despite Jhas best efforts, the numbers did not cross 31.\nRMLs experience of vaccination is not an exception. A week into the launch of the much-awaited vaccination drive against Covid-19 in India, the rollout is progressin","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-23T17:30:00","provider":{"name":"economictimes","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://img.etimg.com/thumb/msid-80425308,width-1070,height-580,imgsize-85027,overlay-economictimes/photo.jpg","height":580,"width":1070,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=8547369341058794505","thumbnailHeight":290,"thumbnailWidth":535,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"economictimes","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"http://economictimes.com/industry/healthcare/biotech/healthcare/overcoming-vaccine-hesitancy-the-key-to-a-successful-covid-19-inoculation-drive/articleshow/80425307.cms"}},{"id":"4157510556035660958","title":"Heres how diamonds are made","url":"http://timesofindia.com/life-style/fashion/luxury/featured/heres-how-diamonds-are-made/articleshow/80420806.cms","description":"Have you ever wondered where all those shiny diamonds, which fit perfectly into rings and necklaces, come from? Well, jewellers dont just get shiny,","body":"Heres how diamonds are made\nBy -\nCreated: Jan 24, 2021, 09:00 IST\nfacebook\ntwitter\nPintrest\nHave you ever wondered where all those shiny diamonds, which fit perfectly into rings and necklaces, come from? Well, jewellers dont just get shiny, perfectly shaped diamonds from the ground, there is much more to it. If you want to know more about how diamonds are made or what the process is, then weve got you covered. We got in touch with Dr C Vinod Hayagriv, Director & Managing Director, 150 years C Krishniah Chetty Group Of Jewellers to enlighten us about how diamonds are produced, extracted, and formed to result in those precious shiny gems that adorn our necks, fingers, and arms.\nWhat Are Diamonds?\nDiamonds are one of the rarest gems to exist on the planet earth. It has been used for many purposes for years. It is commonly used in making expensive, high-end jewellery items. They are available worldwide on several websites and physical stores. Those websites and stores offer a variety of kinds of diamonds.\nFrom different cuts to clarity, colour to shape, they offer it all. How to choose the right diamond is a topic for another time. For now, lets talk about how diamonds are actually made. Or about how the final product of an un-mounted diamond you usually see is made.\nDiamond is a rare, naturally occurring mineral made out of carbon. It is basically the crystallized form of carbon present inside the deep layers of earth. The most commonly known method of diamond production is the natural process. Most people believe that diamonds are basically made out of coals, which is definitely not true. Coals are just the solidified form of carbon, while diamonds are the crystallized form. All the carbon trapped inside the deepest layers of earth is turned into either coal or diamond. The carbon that turns into a diamond is much clearer and cleaner than the carbon that turns into c","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-24T03:30:00","provider":{"name":"timesofindia","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://static.toiimg.com/thumb/msid-80420806,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-203605/80420806.jpg","height":580,"width":1070,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=2438444688210630445","thumbnailHeight":217,"thumbnailWidth":400,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"timesofindia","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"http://timesofindia.com/life-style/fashion/luxury/featured/heres-how-diamonds-are-made/articleshow/80420806.cms"}},{"id":"8608486872579431875","title":"'The White Tiger'  the film belongs to Adarsh Gourav","url":"https://dailytimes.com.pk/716459/the-white-tiger-the-film-belongs-to-adarsh-gourav/","description":"Ramin Bahranis savage, darkly comic adaptation of Arvind Adigas prize-winning The White Tiger is full of these brushstrokes which teeter on the verge of being either banal or profound, but which could only come from a man who has clawed his way up the caste-class ladder in India. A man who comes once in a []","body":"The White Tiger  the film belongs to Adarsh Gourav\nJanuary 24, 2021\nRamin Bahranis savage, darkly comic adaptation of Arvind Adigas prize-winning The White Tiger is full of these brushstrokes which teeter on the verge of being either banal or profound, but which could only come from a man who has clawed his way up the caste-class ladder in India.\nA man who comes once in a generation, an impossibility, just like a white tiger.\nAnd that man is Balram Halwai, a servant who believes that his future lies in serving his master with everything he possesses. He knows that the only way he can get into the good books of his rich landlord and his older son is by diving at their feet, and that bowing and scraping will be his lot, until he gets to his real target, the younger US-returned son Ashok\nWhen Adigas 2008 novel came out, Bangalore was the mecca of those who wanted to do something. Watching Ashoks eagerness to get there in order to start his start-up already feels dated: the spread of information technology and its multi-million dollar spinoffs, has created many similar hubs in India. But the crucial element which has the same bite still is the cavernous gap between men with big bellies and men with small bellies, between men like Ashok and Balram, and how hard it is to bridge that gap.\nWhen Adigas 2008 novel came out, Bangalore was the hub of those who wanted to do something. Watching Ashoks eagerness to get there in order to start his start-up already feels dated: the spread of information technology and its multi-million dollar spinoffs, has created many similar hubs in India\nAmbition comes easily to men like Ashok, who has acquired speedily those accoutrements many desis do when they get to the US: an accent","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-24T02:51:10","provider":{"name":"dailytimes","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://dailytimes.com.pk/assets/uploads/2021/01/MV5BMDVkMDRkMzItN2EyYS00ZTI5LTljYzgtNzRmZDQ0OTQ3M2VjXkEyXkFqcGdeQXVyODk4OTc3MTY@._V1__resize.jpg","height":450,"width":304,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=9219705583521617201","thumbnailHeight":84,"thumbnailWidth":56,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"dailytimes","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://dailytimes.com.pk/716459/the-white-tiger-the-film-belongs-to-adarsh-gourav/"}},{"id":"6640209729310019164","title":"'If China gets aggressive, so will India': IAF chief amid border standoff","url":"https://www.oneindia.com/india/if-china-gets-aggressive-so-will-india-iaf-chief-amid-border-standoff-3206645.html?utm_source=/rss/news-india-fb.xml&utm_medium=23.55.162.140&utm_campaign=client-rss","description":"India too 'can be aggressive' if China tries to get aggressive along the Line of Actual Control (LAC), asserted Indian Air Force chief Air Chief Marshal RKS Bhadauria on Saturday amid border standoff with Beiing.","body":"|\nPublished: Saturday, January 23, 2021, 22:15 [IST]\nNew Delhi, Jan 23: India too \"can be aggressive\" if China tries to get aggressive along the Line of Actual Control (LAC), asserted Indian Air Force chief Marshal RKS Bhadauria on Saturday amid border standoff with Beiing.\nRKS Bhadauria\n\"If they (China) can get aggressive, we will also get aggressive. We have full preparations (to meet any eventuality,)\" the IAF chief said during a media interaction at Jodhpur.\nThe statement cames a day ahead of the ninth round of military talks with China to defuse border tensions in Ladakh.\nThere have been 8 rounds of talks, but both sides have not been able to work out a solution as yet.\nIndia-China to hold 9th round of military commander level talks tomorrow\nIndia and China are locked in a border dispute since May last year. Tensions were further escalated after the Galwan Valley clash in which 20 Indian soldiers were martyred and an equal number of Chinese soldiers were either killed or went missing.\nIndia has all along been maintaining that the onus is on China to carry forward the process of disengagement and de-escalation at the friction points in the mountainous region.\nIn a clear message to China, Chief of Army Staff Gen M M Naravane last week said India is committed to resolve the eastern Ladakh standoff through talks but no one should make any mistake of testing its patience.\nEarlier, Bhadauria had said any serious conflict with India does not suit China''s global aspirations and \"grand plans\" and the trigger for the Ladakh face-off could be the result of a variety of reasons including a \"military dominated misadventure\" that escalated following the rapid trust deficit faced by the neighbouring country due to the coronavirus pandemic.","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-23T16:45:19","provider":{"name":"oneindia","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://www.oneindia.com/img/1200x80/2021/01/1-3-1611402668-1611420234.jpg","height":676,"width":1200,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=5938618926549714337","thumbnailHeight":126,"thumbnailWidth":223,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"oneindia","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"https://www.oneindia.com/india/if-china-gets-aggressive-so-will-india-iaf-chief-amid-border-standoff-3206645.html?utm_source=/rss/news-india-fb.xml&utm_medium=23.55.162.140&utm_campaign=client-rss"}},{"id":"2962369483677851818","title":"England star Ben Stokes boards flight ahead of Test series against Virat Kohli & Co.","url":"http://timesnow.tv/sports/cricket/article/see-you-soon-india-england-star-ben-stokes-boards-flight-ahead-of-test-series-against-virat-kohli-co/711163","description":"England star all-rounder Ben Stokes, who has been rested for the Sri Lanka Tests, recently boarded the flight for India for the four-match Test series versus Virat Kohli-led hosts.","body":"Aditya Sahay\nUpdated Jan 24, 2021 | 07:42IST\nEngland star all-rounder Ben Stokes, who has been rested for the Sri Lanka Tests, recently boarded the flight for India for the four-match Test series versus Virat Kohli-led hosts.\nBen Stokes boards flight for India ahead of 4 Tests vs Virat Kohli & Co. Photo credits: Ben Stokes/AP&nbsp | &nbspPhoto Credit:&nbspTwitter\nEngland star all-rounder Ben Stokes recently boarded the flight for India ahead of his side's four-match Test series versus Virat Kohli-led hosts, starting from February 05. While the Joe Root-led England are currently involved in the final game of the two-match Test series versus Sri Lanka, in the Island nation, they won't get much rest as the India tour is scheduled to follow suit.\nEngland will be touring India after a long gap, their last visit was for the limited-overs leg in early 2017, and will look to avenge their humiliating 4-0 loss at the hands of Kohli-led India in the five-match Test series in 2016-17. Back then, Alastair Cook was in charge of the side. Thus, this will be Root's first assignment as a Test captain in India, with Stokes acting as his deputy. Talking about the latter, Stokes averages only 27.25 versus India but has fared decently with the bat in Indian conditions (345 runs at 38.33 along with 8 scalps).\nStokes, who has received much love from Indian fans due to his IPL heroics, took to his official Twitter handle and shared a post, showing his excitement for the India trip. Here's his post from his official handle:\nSee you soon India","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-24T02:12:13","provider":{"name":"timesnow","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://imgk.timesnownews.com/story/pjimage_-_2021-01-24T071715.754.jpg?tr=w-560,h-292,fo-top","height":292,"width":560,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=310492735998849123","thumbnailHeight":146,"thumbnailWidth":280,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"timesnow","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"http://timesnow.tv/sports/cricket/article/see-you-soon-india-england-star-ben-stokes-boards-flight-ahead-of-test-series-against-virat-kohli-co/711163"}},{"id":"707499680809520388","title":"Sri Lanka to receive India's 'gift' of COVID-19 vaccines on January 27","url":"http://zeenews.com/world/sri-lanka-to-receive-indias-gift-of-covid-19-vaccine-on-january-27-2337513.html","description":"India announced that it will be sending a 'gift' of COVID-19 vaccines to Sri Lanka next week. The island nation will be getting 500,000 doses of \"made-in-India\" Covishield vaccine. Sri Lankan President Gotabaya Rajapaksa has announced, the vaccine will reach the country on January 27.","body":"Jan 24, 2021, 07:47 AM IST\nHighlights\nIndia announced that it will be sending a 'gift' of COVID-19 vaccines to Sri Lanka next week.\nThe island nation will be getting 500,000 doses of \"made-in-India\" Covishield vaccine.\nSri Lanka becomes the eighth nation to receive India's gift of COVID-19 vaccines.\nNew Delhi: India announced that it will be sending a 'gift' of COVID-19 vaccines to Sri Lanka next week. Sri Lankan President Gotabaya Rajapaksa has announced, the vaccine will reach the country on January 27.\nThe country will be getting 500,000 doses of \"made-in-India\" Covishield vaccine. Sri Lanka becomes the eighth nation to receive India's gift of\nsince it began its country-wide mega immunization program on January 16.\nStarting Wednesday,\nIndia has gifted vaccines\nto seven countries in the region as part of its neighbourhood first policy, to Bhutan 150,000 doses, to Maldives 100,000 doses, to Nepal around 1 million doses, to Bangladesh around 2 million doses, Myanmar received 1.5 million doses, Seychelles was goven 50,000 doseswhile Mauritius was gifted 100,000 COVID-19 doses.\nIndia was so far waiting for regulatory approval from Sri Lankan and Afghan authorities The Sri Lanka's drugs regulatory body  National Medicines Regulatory Authority (NMRA) gave a go ahead to Oxford Astrazeneca's vaccine on Friday.\nThe Indian embassy on Sri Lanka had welcomed the development, tweeting, \"his clears the way for scheduling  delivery of the vaccine from #India to #lka\"\nWelcome emergency use approval of COVISHIELD vaccines by Government of Sri Lanka. This clears the way for scheduling delivery of the vaccine from #Indiato #lka. #VaccineMaitri","keywords":"","language":"en","isSafe":true,"datePublished":"2021-01-24T02:08:39","provider":{"name":"zeenews","favIcon":"","favIconBase64Encoding":""},"image":{"url":"https://english.cdn.zeenews.com/sites/default/files/2021/01/24/912414-vaccine-inject.jpg","height":545,"width":970,"thumbnail":"https://rapidapi.usearch.com/api/thumbnail/get?value=8074294484596437146","thumbnailHeight":272,"thumbnailWidth":484,"base64Encoding":null,"name":null,"title":null,"provider":{"name":"zeenews","favIcon":"","favIconBase64Encoding":""},"imageWebSearchUrl":null,"webpageUrl":"http://zeenews.com/world/sri-lanka-to-receive-indias-gift-of-covid-19-vaccine-on-january-27-2337513.html"}}]
